{
    "character": "sonia",
    "searches": [
        {
            "book": "Crime and Punishment",
            "count": 289,
            "matches": [
                {
                    "line_number": 152,
                    "text": "“Young man,” he went on, raising his head again, “in your face I seem to read some trouble of mind. When you came in I read it, and that was why I addressed you at once. For in unfolding to you the story of my life, I do not wish to make myself a laughing-stock before these idle listeners, who indeed know all about it already, but I am looking for a man of feeling and education. Know then that my wife was educated in a high-class school for the daughters of noblemen, and on leaving she danced the shawl dance before the governor and other personages for which she was presented with a gold medal and a certificate of merit. The medal... well, the medal of course was sold—long ago, hm... but the certificate of merit is in her trunk still and not long ago she showed it to our landlady. And although she is most continually on bad terms with the landlady, yet she wanted to tell someone or other of her past honours and of the happy days that are gone. I don’t condemn her for it, I don’t blame her, for the one thing left her is recollection of the past, and all the rest is dust and ashes. Yes, yes, she is a lady of spirit, proud and determined. She scrubs the floors herself and has nothing but black bread to eat, but won’t allow herself to be treated with disrespect. That’s why she would not overlook Mr. Lebeziatnikov’s rudeness to her, and so when he gave her a beating for it, she took to her bed more from the hurt to her feelings than from the blows. She was a widow when I married her, with three children, one smaller than the other. She married her first husband, an infantry officer, for love, and ran away with him from her father’s house. She was exceedingly fond of her husband; but he gave way to cards, got into trouble and with that he died. He used to beat her at the end: and although she paid him back, of which I have authentic documentary evidence, to this day she speaks of him with tears and she throws him up to me; and I am glad, I am glad that, though only in imagination, she should think of herself as having once been happy.... And she was left at his death with three children in a wild and remote district where I happened to be at the time; and she was left in such hopeless poverty that, although I have seen many ups and downs of all sort, I don’t feel equal to describing it even. Her relations had all thrown her off. And she was proud, too, excessively proud.... And then, honoured sir, and then, I, being at the time a widower, with a daughter of fourteen left me by my first wife, offered her my hand, for I could not bear the sight of such suffering. You can judge the extremity of her calamities, that she, a woman of education and culture and distinguished family, should have consented to be my wife. But she did! Weeping and sobbing and wringing her hands, she married me! For she had nowhere to turn! Do you understand, sir, do you understand what it means when you have absolutely nowhere to turn? No, that you don’t understand yet.... And for a whole year, I performed my duties conscientiously and faithfully, and did not touch this” (he tapped the jug with his finger), “for I have feelings. But even so, I could not please her; and then I lost my place too, and that through no fault of mine but through changes in the office; and then I did touch it!... It will be a year and a half ago soon since we found ourselves at last after many wanderings and numerous calamities in this magnificent capital, adorned with innumerable monuments. Here I obtained a situation.... I obtained it and I lost it again. Do you understand? This time it was through my own fault I lost it: for my weakness had come out.... We have now part of a room at Amalia Fyodorovna Lippevechsel’s; and what we live upon and what we pay our rent with, I could not say. There are a lot of people living there besides ourselves. Dirt and disorder, a perfect Bedlam... hm... yes... And meanwhile my daughter by my first wife has grown up; and what my daughter has had to put up with from her step-mother whilst she was growing up, I won’t speak of. For, though Katerina Ivanovna is full of generous feelings, she is a spirited lady, irritable and short-tempered.... Yes. But it’s no use going over that! Sonia, as you may well fancy, has had no education. I did make an effort four years ago to give her a course of geography and universal history, but as I was not very well up in those subjects myself and we had no suitable books, and what books we had... hm, anyway we have not even those now, so all our instruction came to an end. We stopped at Cyrus of Persia. Since she has attained years of maturity, she has read other books of romantic tendency and of late she had read with great interest a book she got through Mr. Lebeziatnikov, Lewes’ Physiology—do you know it?—and even recounted extracts from it to us: and that’s the whole of her education. And now may I venture to address you, honoured sir, on my own account with a private question. Do you suppose that a respectable poor girl can earn much by honest work? Not fifteen farthings a day can she earn, if she is respectable and has no special talent and that without putting her work down for an instant! And what’s more, Ivan Ivanitch Klopstock the civil counsellor—have you heard of him?—has not to this day paid her for the half-dozen linen shirts she made him and drove her roughly away, stamping and reviling her, on the pretext that the shirt collars were not made like the pattern and were put in askew. And there are the little ones hungry.... And Katerina Ivanovna walking up and down and wringing her hands, her cheeks flushed red, as they always are in that disease: ‘Here you live with us,’ says she, ‘you eat and drink and are kept warm and you do nothing to help.’ And much she gets to eat and drink when there is not a crust for the little ones for three days! I was lying at the time... well, what of it! I was lying drunk and I heard my Sonia speaking (she is a gentle creature with a soft little voice... fair hair and such a pale, thin little face). She said: ‘Katerina Ivanovna, am I really to do a thing like that?’ And Darya Frantsovna, a woman of evil character and very well known to the police, had two or three times tried to get at her through the landlady. ‘And why not?’ said Katerina Ivanovna with a jeer, ‘you are something mighty precious to be so careful of!’ But don’t blame her, don’t blame her, honoured sir, don’t blame her! She was not herself when she spoke, but driven to distraction by her illness and the crying of the hungry children; and it was said more to wound her than anything else.... For that’s Katerina Ivanovna’s character, and when children cry, even from hunger, she falls to beating them at once. At six o’clock I saw Sonia get up, put on her kerchief and her cape, and go out of the room and about nine o’clock she came back. She walked straight up to Katerina Ivanovna and she laid thirty roubles on the table before her in silence. She did not utter a word, she did not even look at her, she simply picked up our big green drap de dames shawl (we have a shawl, made of drap de dames), put it over her head and face and lay down on the bed with her face to the wall; only her little shoulders and her body kept shuddering.... And I went on lying there, just as before.... And then I saw, young man, I saw Katerina Ivanovna, in the same silence go up to Sonia’s little bed; she was on her knees all the evening kissing Sonia’s feet, and would not get up, and then they both fell asleep in each other’s arms... together, together... yes... and I... lay drunk.”"
                },
                {
                    "line_number": 156,
                    "text": "“Since then, sir,” he went on after a brief pause—“Since then, owing to an unfortunate occurrence and through information given by evil-intentioned persons—in all which Darya Frantsovna took a leading part on the pretext that she had been treated with want of respect—since then my daughter Sofya Semyonovna has been forced to take a yellow ticket, and owing to that she is unable to go on living with us. For our landlady, Amalia Fyodorovna would not hear of it (though she had backed up Darya Frantsovna before) and Mr. Lebeziatnikov too... hm.... All the trouble between him and Katerina Ivanovna was on Sonia’s account. At first he was for making up to Sonia himself and then all of a sudden he stood on his dignity: ‘how,’ said he, ‘can a highly educated man like me live in the same rooms with a girl like that?’ And Katerina Ivanovna would not let it pass, she stood up for her... and so that’s how it happened. And Sonia comes to us now, mostly after dark; she comforts Katerina Ivanovna and gives her all she can.... She has a room at the Kapernaumovs’ the tailors, she lodges with them; Kapernaumov is a lame man with a cleft palate and all of his numerous family have cleft palates too. And his wife, too, has a cleft palate. They all live in one room, but Sonia has her own, partitioned off.... Hm... yes... very poor people and all with cleft palates... yes. Then I got up in the morning, and put on my rags, lifted up my hands to heaven and set off to his excellency Ivan Afanasyvitch. His excellency Ivan Afanasyvitch, do you know him? No? Well, then, it’s a man of God you don’t know. He is wax... wax before the face of the Lord; even as wax melteth!... His eyes were dim when he heard my story. ‘Marmeladov, once already you have deceived my expectations... I’ll take you once more on my own responsibility’—that’s what he said, ‘remember,’ he said, ‘and now you can go.’ I kissed the dust at his feet—in thought only, for in reality he would not have allowed me to do it, being a statesman and a man of modern political and enlightened ideas. I returned home, and when I announced that I’d been taken back into the service and should receive a salary, heavens, what a to-do there was!...”"
                },
                {
                    "line_number": 160,
                    "text": "“That was five weeks ago, sir. Yes.... As soon as Katerina Ivanovna and Sonia heard of it, mercy on us, it was as though I stepped into the kingdom of Heaven. It used to be: you can lie like a beast, nothing but abuse. Now they were walking on tiptoe, hushing the children. ‘Semyon Zaharovitch is tired with his work at the office, he is resting, shh!’ They made me coffee before I went to work and boiled cream for me! They began to get real cream for me, do you hear that? And how they managed to get together the money for a decent outfit—eleven roubles, fifty copecks, I can’t guess. Boots, cotton shirt-fronts—most magnificent, a uniform, they got up all in splendid style, for eleven roubles and a half. The first morning I came back from the office I found Katerina Ivanovna had cooked two courses for dinner—soup and salt meat with horse radish—which we had never dreamed of till then. She had not any dresses... none at all, but she got herself up as though she were going on a visit; and not that she’d anything to do it with, she smartened herself up with nothing at all, she’d done her hair nicely, put on a clean collar of some sort, cuffs, and there she was, quite a different person, she was younger and better looking. Sonia, my little darling, had only helped with money ‘for the time,’ she said, ‘it won’t do for me to come and see you too often. After dark maybe when no one can see.’ Do you hear, do you hear? I lay down for a nap after dinner and what do you think: though Katerina Ivanovna had quarrelled to the last degree with our landlady Amalia Fyodorovna only a week before, she could not resist then asking her in to coffee. For two hours they were sitting, whispering together. ‘Semyon Zaharovitch is in the service again, now, and receiving a salary,’ says she, ‘and he went himself to his excellency and his excellency himself came out to him, made all the others wait and led Semyon Zaharovitch by the hand before everybody into his study.’ Do you hear, do you hear? ‘To be sure,’ says he, ‘Semyon Zaharovitch, remembering your past services,’ says he, ‘and in spite of your propensity to that foolish weakness, since you promise now and since moreover we’ve got on badly without you,’ (do you hear, do you hear;) ‘and so,’ says he, ‘I rely now on your word as a gentleman.’ And all that, let me tell you, she has simply made up for herself, and not simply out of wantonness, for the sake of bragging; no, she believes it all herself, she amuses herself with her own fancies, upon my word she does! And I don’t blame her for it, no, I don’t blame her!... Six days ago when I brought her my first earnings in full—twenty-three roubles forty copecks altogether—she called me her poppet: ‘poppet,’ said she, ‘my little poppet.’ And when we were by ourselves, you understand? You would not think me a beauty, you would not think much of me as a husband, would you?... Well, she pinched my cheek, ‘my little poppet,’ said she.”"
                },
                {
                    "line_number": 168,
                    "text": "“This morning I went to see Sonia, I went to ask her for a pick-me-up! He-he-he!”"
                },
                {
                    "line_number": 182,
                    "text": "“Why am I to be pitied, you say? Yes! there’s nothing to pity me for! I ought to be crucified, crucified on a cross, not pitied! Crucify me, oh judge, crucify me but pity me! And then I will go of myself to be crucified, for it’s not merry-making I seek but tears and tribulation!... Do you suppose, you that sell, that this pint of yours has been sweet to me? It was tribulation I sought at the bottom of it, tears and tribulation, and have found it, and I have tasted it; but He will pity us Who has had pity on all men, Who has understood all men and all things, He is the One, He too is the judge. He will come in that day and He will ask: ‘Where is the daughter who gave herself for her cross, consumptive step-mother and for the little children of another? Where is the daughter who had pity upon the filthy drunkard, her earthly father, undismayed by his beastliness?’ And He will say, ‘Come to me! I have already forgiven thee once.... I have forgiven thee once.... Thy sins which are many are forgiven thee for thou hast loved much....’ And he will forgive my Sonia, He will forgive, I know it... I felt it in my heart when I was with her just now! And He will judge and will forgive all, the good and the evil, the wise and the meek.... And when He has done with all of them, then He will summon us. ‘You too come forth,’ He will say, ‘Come forth ye drunkards, come forth, ye weak ones, come forth, ye children of shame!’ And we shall all come forth, without shame and shall stand before him. And He will say unto us, ‘Ye are swine, made in the Image of the Beast and with his mark; but come ye also!’ And the wise ones and those of understanding will say, ‘Oh Lord, why dost Thou receive these men?’ And He will say, ‘This is why I receive them, oh ye wise, this is why I receive them, oh ye of understanding, that not one of them believed himself to be worthy of this.’ And He will hold out His hands to us and we shall fall down before him... and we shall weep... and we shall understand all things! Then we shall understand all!... and all will understand, Katerina Ivanovna even... she will understand.... Lord, Thy kingdom come!” And he sank down on the bench exhausted, and helpless, looking at no one, apparently oblivious of his surroundings and plunged in deep thought. His words had created a certain impression; there was a moment of silence; but soon laughter and oaths were heard again."
                },
                {
                    "line_number": 196,
                    "text": "“It’s not Katerina Ivanovna I am afraid of now,” he muttered in agitation—“and that she will begin pulling my hair. What does my hair matter! Bother my hair! That’s what I say! Indeed it will be better if she does begin pulling it, that’s not what I am afraid of... it’s her eyes I am afraid of... yes, her eyes... the red on her cheeks, too, frightens me... and her breathing too.... Have you noticed how people in that disease breathe... when they are excited? I am frightened of the children’s crying, too.... For if Sonia has not taken them food... I don’t know what’s happened! I don’t know! But blows I am not afraid of.... Know, sir, that such blows are not a pain to me, but even an enjoyment. In fact I can’t get on without it.... It’s better so. Let her strike me, it relieves her heart... it’s better so... There is the house. The house of Kozel, the cabinet-maker... a German, well-to-do. Lead the way!”"
                },
                {
                    "line_number": 216,
                    "text": "“What a stupid thing I’ve done,” he thought to himself, “they have Sonia and I want it myself.” But reflecting that it would be impossible to take it back now and that in any case he would not have taken it, he dismissed it with a wave of his hand and went back to his lodging. “Sonia wants pomatum too,” he said as he walked along the street, and he laughed malignantly—“such smartness costs money.... Hm! And maybe Sonia herself will be bankrupt to-day, for there is always a risk, hunting big game... digging for gold... then they would all be without a crust to-morrow except for my money. Hurrah for Sonia! What a mine they’ve dug there! And they’re making the most of it! Yes, they are making the most of it! They’ve wept over it and grown used to it. Man grows used to everything, the scoundrel!”"
                },
                {
                    "line_number": 318,
                    "text": "“Well,... mother I don’t wonder at, it’s like her, God bless her, but how could Dounia? Dounia darling, as though I did not know you! You were nearly twenty when I saw you last: I understood you then. Mother writes that ‘Dounia can put up with a great deal.’ I know that very well. I knew that two years and a half ago, and for the last two and a half years I have been thinking about it, thinking of just that, that ‘Dounia can put up with a great deal.’ If she could put up with Mr. Svidrigaïlov and all the rest of it, she certainly can put up with a great deal. And now mother and she have taken it into their heads that she can put up with Mr. Luzhin, who propounds the theory of the superiority of wives raised from destitution and owing everything to their husband’s bounty—who propounds it, too, almost at the first interview. Granted that he ‘let it slip,’ though he is a sensible man, (yet maybe it was not a slip at all, but he meant to make himself clear as soon as possible) but Dounia, Dounia? She understands the man, of course, but she will have to live with the man. Why! she’d live on black bread and water, she would not sell her soul, she would not barter her moral freedom for comfort; she would not barter it for all Schleswig-Holstein, much less Mr. Luzhin’s money. No, Dounia was not that sort when I knew her and... she is still the same, of course! Yes, there’s no denying, the Svidrigaïlovs are a bitter pill! It’s a bitter thing to spend one’s life a governess in the provinces for two hundred roubles, but I know she would rather be a nigger on a plantation or a Lett with a German master than degrade her soul, and her moral dignity, by binding herself for ever to a man whom she does not respect and with whom she has nothing in common—for her own advantage. And if Mr. Luzhin had been of unalloyed gold, or one huge diamond, she would never have consented to become his legal concubine. Why is she consenting then? What’s the point of it? What’s the answer? It’s clear enough: for herself, for her comfort, to save her life she would not sell herself, but for someone else she is doing it! For one she loves, for one she adores, she will sell herself! That’s what it all amounts to; for her brother, for her mother, she will sell herself! She will sell everything! In such cases, ‘we overcome our moral feeling if necessary,’ freedom, peace, conscience even, all, all are brought into the market. Let my life go, if only my dear ones may be happy! More than that, we become casuists, we learn to be Jesuitical and for a time maybe we can soothe ourselves, we can persuade ourselves that it is one’s duty for a good object. That’s just like us, it’s as clear as daylight. It’s clear that Rodion Romanovitch Raskolnikov is the central figure in the business, and no one else. Oh, yes, she can ensure his happiness, keep him in the university, make him a partner in the office, make his whole future secure; perhaps he may even be a rich man later on, prosperous, respected, and may even end his life a famous man! But my mother? It’s all Rodya, precious Rodya, her first born! For such a son who would not sacrifice such a daughter! Oh, loving, over-partial hearts! Why, for his sake we would not shrink even from Sonia’s fate. Sonia, Sonia Marmeladov, the eternal victim so long as the world lasts. Have you taken the measure of your sacrifice, both of you? Is it right? Can you bear it? Is it any use? Is there sense in it? And let me tell you, Dounia, Sonia’s life is no worse than life with Mr. Luzhin. ‘There can be no question of love,’ mother writes. And what if there can be no respect either, if on the contrary there is aversion, contempt, repulsion, what then? So you will have to ‘keep up your appearance,’ too. Is not that so? Do you understand what that smartness means? Do you understand that the Luzhin smartness is just the same thing as Sonia’s and may be worse, viler, baser, because in your case, Dounia, it’s a bargain for luxuries, after all, but with Sonia it’s simply a question of starvation. It has to be paid for, it has to be paid for, Dounia, this smartness. And what if it’s more than you can bear afterwards, if you regret it? The bitterness, the misery, the curses, the tears hidden from all the world, for you are not a Marfa Petrovna. And how will your mother feel then? Even now she is uneasy, she is worried, but then, when she sees it all clearly? And I? Yes, indeed, what have you taken me for? I won’t have your sacrifice, Dounia, I won’t have it, mother! It shall not be, so long as I am alive, it shall not, it shall not! I won’t accept it!”"
                },
                {
                    "line_number": 2474,
                    "text": "“Polenka,” cried Katerina Ivanovna, “run to Sonia, make haste. If you don’t find her at home, leave word that her father has been run over and that she is to come here at once... when she comes in. Run, Polenka! there, put on the shawl.”"
                },
                {
                    "line_number": 2546,
                    "text": "Timidly and noiselessly a young girl made her way through the crowd, and strange was her appearance in that room, in the midst of want, rags, death and despair. She, too, was in rags, her attire was all of the cheapest, but decked out in gutter finery of a special stamp, unmistakably betraying its shameful purpose. Sonia stopped short in the doorway and looked about her bewildered, unconscious of everything. She forgot her fourth-hand, gaudy silk dress, so unseemly here with its ridiculous long train, and her immense crinoline that filled up the whole doorway, and her light-coloured shoes, and the parasol she brought with her, though it was no use at night, and the absurd round straw hat with its flaring flame-coloured feather. Under this rakishly-tilted hat was a pale, frightened little face with lips parted and eyes staring in terror. Sonia was a small thin girl of eighteen with fair hair, rather pretty, with wonderful blue eyes. She looked intently at the bed and the priest; she too was out of breath with running. At last whispers, some words in the crowd probably, reached her. She looked down and took a step forward into the room, still keeping close to the door."
                },
                {
                    "line_number": 2574,
                    "text": "“Be silent! No need! I know what you want to say!” And the sick man was silent, but at the same instant his wandering eyes strayed to the doorway and he saw Sonia."
                },
                {
                    "line_number": 2584,
                    "text": "“Sonia! Daughter! Forgive!” he cried, and he tried to hold out his hand to her, but losing his balance, he fell off the sofa, face downwards on the floor. They rushed to pick him up, they put him on the sofa; but he was dying. Sonia with a faint cry ran up, embraced him and remained so without moving. He died in her arms."
                },
                {
                    "line_number": 2612,
                    "text": "“Sister Sonia sent me,” answered the girl, smiling still more brightly."
                },
                {
                    "line_number": 2614,
                    "text": "“I knew it was sister Sonia sent you.”"
                },
                {
                    "line_number": 2616,
                    "text": "“Mamma sent me, too... when sister Sonia was sending me, mamma came up, too, and said ‘Run fast, Polenka.’”"
                },
                {
                    "line_number": 2618,
                    "text": "“Do you love sister Sonia?”"
                },
                {
                    "line_number": 2634,
                    "text": "“Of course, we do! We knew them long ago. I say my prayers to myself as I am a big girl now, but Kolya and Lida say them aloud with mother. First they repeat the ‘Ave Maria’ and then another prayer: ‘Lord, forgive and bless sister Sonia,’ and then another, ‘Lord, forgive and bless our second father.’ For our elder father is dead and this is another one, but we do pray for the other as well.”"
                },
                {
                    "line_number": 3355,
                    "text": "At Sonia’s entrance, Razumihin, who had been sitting on one of Raskolnikov’s three chairs, close to the door, got up to allow her to enter. Raskolnikov had at first shown her the place on the sofa where Zossimov had been sitting, but feeling that the sofa which served him as a bed, was too familiar a place, he hurriedly motioned her to Razumihin’s chair."
                },
                {
                    "line_number": 3359,
                    "text": "Sonia sat down, almost shaking with terror, and looked timidly at the two ladies. It was evidently almost inconceivable to herself that she could sit down beside them. At the thought of it, she was so frightened that she hurriedly got up again, and in utter confusion addressed Raskolnikov."
                },
                {
                    "line_number": 3361,
                    "text": "“I... I... have come for one minute. Forgive me for disturbing you,” she began falteringly. “I come from Katerina Ivanovna, and she had no one to send. Katerina Ivanovna told me to beg you... to be at the service... in the morning... at Mitrofanievsky... and then... to us... to her... to do her the honour... she told me to beg you...” Sonia stammered and ceased speaking."
                },
                {
                    "line_number": 3365,
                    "text": "Sonia sat down again, and again timidly she took a hurried, frightened look at the two ladies, and dropped her eyes. Raskolnikov’s pale face flushed, a shudder passed over him, his eyes glowed."
                },
                {
                    "line_number": 3369,
                    "text": "Pulcheria Alexandrovna glanced at Sonia, and slightly screwed up her eyes. In spite of her embarrassment before Rodya’s urgent and challenging look, she could not deny herself that satisfaction. Dounia gazed gravely and intently into the poor girl’s face, and scrutinised her with perplexity. Sonia, hearing herself introduced, tried to raise her eyes again, but was more embarrassed than ever."
                },
                {
                    "line_number": 3397,
                    "text": "“You gave us everything yesterday,” Sonia said suddenly, in reply, in a loud rapid whisper; and again she looked down in confusion. Her lips and chin were trembling once more. She had been struck at once by Raskolnikov’s poor surroundings, and now these words broke out spontaneously. A silence followed. There was a light in Dounia’s eyes, and even Pulcheria Alexandrovna looked kindly at Sonia."
                },
                {
                    "line_number": 3415,
                    "text": "Pulcheria Alexandrovna meant to greet Sonia, too; but it somehow failed to come off, and she went in a flutter out of the room."
                },
                {
                    "line_number": 3417,
                    "text": "But Avdotya Romanovna seemed to await her turn, and following her mother out, gave Sonia an attentive, courteous bow. Sonia, in confusion, gave a hurried, frightened curtsy. There was a look of poignant discomfort in her face, as though Avdotya Romanovna’s courtesy and attention were oppressive and painful to her."
                },
                {
                    "line_number": 3427,
                    "text": "“Come, that’s capital,” he said to Sonia, going back and looking brightly at her. “God give peace to the dead, the living have still to live. That is right, isn’t it?”"
                },
                {
                    "line_number": 3429,
                    "text": "Sonia looked surprised at the sudden brightness of his face. He looked at her for some moments in silence. The whole history of the dead father floated before his memory in those moments...."
                },
                {
                    "line_number": 3467,
                    "text": "“Then I will tell Katerina Ivanovna that you are coming,” Sonia said hurriedly, preparing to depart."
                },
                {
                    "line_number": 3487,
                    "text": "“If you have to go now,” Sonia was beginning, not looking at Razumihin at all, and still more embarrassed."
                },
                {
                    "line_number": 3491,
                    "text": "He was not exactly ill at ease, but seemed hurried, and avoided her eyes. Sonia gave her address, and flushed as she did so. They all went out together."
                },
                {
                    "line_number": 3495,
                    "text": "“Never,” answered Raskolnikov. “I have been meaning to buy a lock for these two years. People are happy who have no need of locks,” he said, laughing, to Sonia. They stood still in the gateway."
                },
                {
                    "line_number": 3513,
                    "text": "She was not capable at that instant of noticing an unknown gentleman who was watching her and following at her heels. He had accompanied her from the gateway. At the moment when Razumihin, Raskolnikov, and she stood still at parting on the pavement, this gentleman, who was just passing, started on hearing Sonia’s words: “and I asked where Mr. Raskolnikov lived?” He turned a rapid but attentive look upon all three, especially upon Raskolnikov, to whom Sonia was speaking; then looked back and noted the house. All this was done in an instant as he passed, and trying not to betray his interest, he walked on more slowly as though waiting for something. He was waiting for Sonia; he saw that they were parting, and that Sonia was going home."
                },
                {
                    "line_number": 3517,
                    "text": "At the turning he crossed over, looked round, and saw Sonia coming the same way, noticing nothing. She turned the corner. He followed her on the other side. After about fifty paces he crossed over again, overtook her and kept two or three yards behind her."
                },
                {
                    "line_number": 3521,
                    "text": "When Sonia came out on the canal bank, they were the only two persons on the pavement. He observed her dreaminess and preoccupation. On reaching the house where she lodged, Sonia turned in at the gate; he followed her, seeming rather surprised. In the courtyard she turned to the right corner. “Bah!” muttered the unknown gentleman, and mounted the stairs behind her. Only then Sonia noticed him. She reached the third storey, turned down the passage, and rang at No. 9. On the door was inscribed in chalk, “Kapernaumov, Tailor.” “Bah!” the stranger repeated again, wondering at the strange coincidence, and he rang next door, at No. 8. The doors were two or three yards apart."
                },
                {
                    "line_number": 3523,
                    "text": "“You lodge at Kapernaumov’s,” he said, looking at Sonia and laughing. “He altered a waistcoat for me yesterday. I am staying close here at Madame Resslich’s. How odd!” Sonia looked at him attentively."
                },
                {
                    "line_number": 3527,
                    "text": "Sonia made no reply; the door opened and she slipped in. She felt for some reason ashamed and uneasy."
                },
                {
                    "line_number": 4049,
                    "text": "“Mother, sister—how I loved them! Why do I hate them now? Yes, I hate them, I feel a physical hatred for them, I can’t bear them near me.... I went up to my mother and kissed her, I remember.... To embrace her and think if she only knew... shall I tell her then? That’s just what I might do.... She must be the same as I am,” he added, straining himself to think, as it were struggling with delirium. “Ah, how I hate the old woman now! I feel I should kill her again if she came to life! Poor Lizaveta! Why did she come in?... It’s strange though, why is it I scarcely ever think of her, as though I hadn’t killed her? Lizaveta! Sonia! Poor gentle things, with gentle eyes.... Dear women! Why don’t they weep? Why don’t they moan? They give up everything... their eyes are soft and gentle.... Sonia, Sonia! Gentle Sonia!”"
                },
                {
                    "line_number": 4668,
                    "text": "Raskolnikov went straight to the house on the canal bank where Sonia lived. It was an old green house of three storeys. He found the porter and obtained from him vague directions as to the whereabouts of Kapernaumov, the tailor. Having found in the corner of the courtyard the entrance to the dark and narrow staircase, he mounted to the second floor and came out into a gallery that ran round the whole second storey over the yard. While he was wandering in the darkness, uncertain where to turn for Kapernaumov’s door, a door opened three paces from him; he mechanically took hold of it."
                },
                {
                    "line_number": 4676,
                    "text": "“It’s you! Good heavens!” cried Sonia weakly, and she stood rooted to the spot."
                },
                {
                    "line_number": 4680,
                    "text": "A minute later Sonia, too, came in with the candle, set down the candlestick and, completely disconcerted, stood before him inexpressibly agitated and apparently frightened by his unexpected visit. The colour rushed suddenly to her pale face and tears came into her eyes... She felt sick and ashamed and happy, too.... Raskolnikov turned away quickly and sat on a chair by the table. He scanned the room in a rapid glance."
                },
                {
                    "line_number": 4682,
                    "text": "It was a large but exceedingly low-pitched room, the only one let by the Kapernaumovs, to whose rooms a closed door led in the wall on the left. In the opposite side on the right hand wall was another door, always kept locked. That led to the next flat, which formed a separate lodging. Sonia’s room looked like a barn; it was a very irregular quadrangle and this gave it a grotesque appearance. A wall with three windows looking out on to the canal ran aslant so that one corner formed a very acute angle, and it was difficult to see in it without very strong light. The other corner was disproportionately obtuse. There was scarcely any furniture in the big room: in the corner on the right was a bedstead, beside it, nearest the door, a chair. A plain, deal table covered by a blue cloth stood against the same wall, close to the door into the other flat. Two rush-bottom chairs stood by the table. On the opposite wall near the acute angle stood a small plain wooden chest of drawers looking, as it were, lost in a desert. That was all there was in the room. The yellow, scratched and shabby wall-paper was black in the corners. It must have been damp and full of fumes in the winter. There was every sign of poverty; even the bedstead had no curtain."
                },
                {
                    "line_number": 4684,
                    "text": "Sonia looked in silence at her visitor, who was so attentively and unceremoniously scrutinising her room, and even began at last to tremble with terror, as though she was standing before her judge and the arbiter of her destinies."
                },
                {
                    "line_number": 4688,
                    "text": "“Yes,” muttered Sonia, “oh yes, it is,” she added, hastily, as though in that lay her means of escape. “My landlady’s clock has just struck... I heard it myself....”"
                },
                {
                    "line_number": 4696,
                    "text": "“Then you are not coming to Katerina Ivanovna to-morrow?” Sonia’s voice shook."
                },
                {
                    "line_number": 4708,
                    "text": "He took her hand. Sonia smiled faintly."
                },
                {
                    "line_number": 4734,
                    "text": "“They are very good people, very kind,” answered Sonia, who still seemed bewildered, “and all the furniture, everything... everything is theirs. And they are very kind and the children, too, often come to see me.”"
                },
                {
                    "line_number": 4742,
                    "text": "Sonia was confused."
                },
                {
                    "line_number": 4752,
                    "text": "“Yes,” Sonia whispered abruptly, again overcome with confusion and looking down."
                },
                {
                    "line_number": 4756,
                    "text": "“Oh no, what are you saying? No!” Sonia looked at him almost with dismay."
                },
                {
                    "line_number": 4760,
                    "text": "“Love her? Of course!” said Sonia with plaintive emphasis, and she clasped her hands in distress. “Ah, you don’t.... If you only knew! You see, she is quite like a child.... Her mind is quite unhinged, you see... from sorrow. And how clever she used to be... how generous... how kind! Ah, you don’t understand, you don’t understand!”"
                },
                {
                    "line_number": 4762,
                    "text": "Sonia said this as though in despair, wringing her hands in excitement and distress. Her pale cheeks flushed, there was a look of anguish in her eyes. It was clear that she was stirred to the very depths, that she was longing to speak, to champion, to express something. A sort of insatiable compassion, if one may so express it, was reflected in every feature of her face."
                },
                {
                    "line_number": 4768,
                    "text": "Sonia looked at him inquiringly."
                },
                {
                    "line_number": 4772,
                    "text": "“I don’t know,” Sonia articulated mournfully."
                },
                {
                    "line_number": 4780,
                    "text": "“Oh, no, don’t talk like that.... We are one, we live like one.” Sonia was agitated again and even angry, as though a canary or some other little bird were to be angry. “And what could she do? What, what could she do?” she persisted, getting hot and excited. “And how she cried to-day! Her mind is unhinged, haven’t you noticed it? At one minute she is worrying like a child that everything should be right to-morrow, the lunch and all that.... Then she is wringing her hands, spitting blood, weeping, and all at once she will begin knocking her head against the wall, in despair. Then she will be comforted again. She builds all her hopes on you; she says that you will help her now and that she will borrow a little money somewhere and go to her native town with me and set up a boarding school for the daughters of gentlemen and take me to superintend it, and we will begin a new splendid life. And she kisses and hugs me, comforts me, and you know she has such faith, such faith in her fancies! One can’t contradict her. And all the day long she has been washing, cleaning, mending. She dragged the wash tub into the room with her feeble hands and sank on the bed, gasping for breath. We went this morning to the shops to buy shoes for Polenka and Lida for theirs are quite worn out. Only the money we’d reckoned wasn’t enough, not nearly enough. And she picked out such dear little boots, for she has taste, you don’t know. And there in the shop she burst out crying before the shopmen because she hadn’t enough.... Ah, it was sad to see her....”"
                },
                {
                    "line_number": 4784,
                    "text": "“And aren’t you sorry for them? Aren’t you sorry?” Sonia flew at him again. “Why, I know, you gave your last penny yourself, though you’d seen nothing of it, and if you’d seen everything, oh dear! And how often, how often I’ve brought her to tears! Only last week! Yes, I! Only a week before his death. I was cruel! And how often I’ve done it! Ah, I’ve been wretched at the thought of it all day!”"
                },
                {
                    "line_number": 4786,
                    "text": "Sonia wrung her hands as she spoke at the pain of remembering it."
                },
                {
                    "line_number": 4790,
                    "text": "“Yes, I—I. I went to see them,” she went on, weeping, “and father said, ‘read me something, Sonia, my head aches, read to me, here’s a book.’ He had a book he had got from Andrey Semyonovitch Lebeziatnikov, he lives there, he always used to get hold of such funny books. And I said, ‘I can’t stay,’ as I didn’t want to read, and I’d gone in chiefly to show Katerina Ivanovna some collars. Lizaveta, the pedlar, sold me some collars and cuffs cheap, pretty, new, embroidered ones. Katerina Ivanovna liked them very much; she put them on and looked at herself in the glass and was delighted with them. ‘Make me a present of them, Sonia,’ she said, ‘please do.’ ‘Please do,’ she said, she wanted them so much. And when could she wear them? They just reminded her of her old happy days. She looked at herself in the glass, admired herself, and she has no clothes at all, no things of her own, hasn’t had all these years! And she never asks anyone for anything; she is proud, she’d sooner give away everything. And these she asked for, she liked them so much. And I was sorry to give them. ‘What use are they to you, Katerina Ivanovna?’ I said. I spoke like that to her, I ought not to have said that! She gave me such a look. And she was so grieved, so grieved at my refusing her. And it was so sad to see.... And she was not grieved for the collars, but for my refusing, I saw that. Ah, if only I could bring it all back, change it, take back those words! Ah, if I... but it’s nothing to you!”"
                },
                {
                    "line_number": 4794,
                    "text": "“Yes.... Did you know her?” Sonia asked with some surprise."
                },
                {
                    "line_number": 4800,
                    "text": "And Sonia unconsciously clutched both his hands, as though imploring that she should not."
                },
                {
                    "line_number": 4804,
                    "text": "“No, not better, not at all better!” Sonia unconsciously repeated in dismay."
                },
                {
                    "line_number": 4808,
                    "text": "“Oh, I don’t know,” cried Sonia, almost in despair, and she put her hands to her head."
                },
                {
                    "line_number": 4816,
                    "text": "And Sonia’s face worked with awful terror."
                },
                {
                    "line_number": 4820,
                    "text": "“Oh, no.... God will not let it be!” broke at last from Sonia’s overburdened bosom."
                },
                {
                    "line_number": 4824,
                    "text": "Raskolnikov got up and began to walk about the room. A minute passed. Sonia was standing with her hands and her head hanging in terrible dejection."
                },
                {
                    "line_number": 4828,
                    "text": "“No,” whispered Sonia."
                },
                {
                    "line_number": 4840,
                    "text": "Sonia was more confused than ever and colour rushed into her face again."
                },
                {
                    "line_number": 4846,
                    "text": "“No, no! It can’t be, no!” Sonia cried aloud in desperation, as though she had been stabbed. “God would not allow anything so awful!”"
                },
                {
                    "line_number": 4854,
                    "text": "Sonia’s face suddenly changed; a tremor passed over it. She looked at him with unutterable reproach, tried to say something, but could not speak and broke into bitter, bitter sobs, hiding her face in her hands."
                },
                {
                    "line_number": 4858,
                    "text": "Five minutes passed. He still paced up and down the room in silence, not looking at her. At last he went up to her; his eyes glittered. He put his two hands on her shoulders and looked straight into her tearful face. His eyes were hard, feverish and piercing, his lips were twitching. All at once he bent down quickly and dropping to the ground, kissed her foot. Sonia drew back from him as from a madman. And certainly he looked like a madman."
                },
                {
                    "line_number": 4866,
                    "text": "“Ach, you said that to them! And in her presence?” cried Sonia, frightened. “Sit down with me! An honour! Why, I’m... dishonourable.... Ah, why did you say that?”"
                },
                {
                    "line_number": 4870,
                    "text": "“But what would become of them?” Sonia asked faintly, gazing at him with eyes of anguish, but not seeming surprised at his suggestion."
                },
                {
                    "line_number": 4872,
                    "text": "Raskolnikov looked strangely at her. He read it all in her face; so she must have had that thought already, perhaps many times, and earnestly she had thought out in her despair how to end it and so earnestly, that now she scarcely wondered at his suggestion. She had not even noticed the cruelty of his words. (The significance of his reproaches and his peculiar attitude to her shame she had, of course, not noticed either, and that, too, was clear to him.) But he saw how monstrously the thought of her disgraceful, shameful position was torturing her and had long tortured her. “What, what,” he thought, “could hitherto have hindered her from putting an end to it?” Only then he realised what those poor little orphan children and that pitiful half-crazy Katerina Ivanovna, knocking her head against the wall in her consumption, meant for Sonia."
                },
                {
                    "line_number": 4874,
                    "text": "But, nevertheless, it was clear to him again that with her character and the amount of education she had after all received, she could not in any case remain so. He was still confronted by the question, how could she have remained so long in that position without going out of her mind, since she could not bring herself to jump into the water? Of course he knew that Sonia’s position was an exceptional case, though unhappily not unique and not infrequent, indeed; but that very exceptionalness, her tinge of education, her previous life might, one would have thought, have killed her at the first step on that revolting path. What held her up—surely not depravity? All that infamy had obviously only touched her mechanically, not one drop of real depravity had penetrated to her heart; he saw that. He saw through her as she stood before him...."
                },
                {
                    "line_number": 4880,
                    "text": "“But can that be true?” he cried to himself. “Can that creature who has still preserved the purity of her spirit be consciously drawn at last into that sink of filth and iniquity? Can the process already have begun? Can it be that she has only been able to bear it till now, because vice has begun to be less loathsome to her? No, no, that cannot be!” he cried, as Sonia had just before. “No, what has kept her from the canal till now is the idea of sin and they, the children.... And if she has not gone out of her mind... but who says she has not gone out of her mind? Is she in her senses? Can one talk, can one reason as she does? How can she sit on the edge of the abyss of loathsomeness into which she is slipping and refuse to listen when she is told of danger? Does she expect a miracle? No doubt she does. Doesn’t that all mean madness?”"
                },
                {
                    "line_number": 4884,
                    "text": "“So you pray to God a great deal, Sonia?” he asked her."
                },
                {
                    "line_number": 4886,
                    "text": "Sonia did not speak; he stood beside her waiting for an answer."
                },
                {
                    "line_number": 4894,
                    "text": "Sonia was silent a long while, as though she could not answer. Her weak chest kept heaving with emotion."
                },
                {
                    "line_number": 4918,
                    "text": "Everything about Sonia seemed to him stranger and more wonderful every moment. He carried the book to the candle and began to turn over the pages."
                },
                {
                    "line_number": 4922,
                    "text": "Sonia looked obstinately at the ground and would not answer. She was standing sideways to the table."
                },
                {
                    "line_number": 4924,
                    "text": "“Where is the raising of Lazarus? Find it for me, Sonia.”"
                },
                {
                    "line_number": 4934,
                    "text": "Sonia heard Raskolnikov’s request distrustfully and moved hesitatingly to the table. She took the book however."
                },
                {
                    "line_number": 4946,
                    "text": "“N-no,” whispered Sonia."
                },
                {
                    "line_number": 4970,
                    "text": "Sonia still hesitated. Her heart was throbbing. She hardly dared to read to him. He looked almost with exasperation at the “unhappy lunatic.”"
                },
                {
                    "line_number": 4976,
                    "text": "Sonia opened the book and found the place. Her hands were shaking, her voice failed her. Twice she tried to begin and could not bring out the first syllable."
                },
                {
                    "line_number": 4980,
                    "text": "Raskolnikov saw in part why Sonia could not bring herself to read to him and the more he saw this, the more roughly and irritably he insisted on her doing so. He understood only too well how painful it was for her to betray and unveil all that was her own. He understood that these feelings really were her secret treasure, which she had kept perhaps for years, perhaps from childhood, while she lived with an unhappy father and a distracted stepmother crazed by grief, in the midst of starving children and unseemly abuse and reproaches. But at the same time he knew now and knew for certain that, although it filled her with dread and suffering, yet she had a tormenting desire to read and to read to him that he might hear it, and to read now whatever might come of it!... He read this in her eyes, he could see it in her intense emotion. She mastered herself, controlled the spasm in her throat and went on reading the eleventh chapter of St. John. She went on to the nineteenth verse:"
                },
                {
                    "line_number": 5002,
                    "text": "(And drawing a painful breath, Sonia read distinctly and forcibly as though she were making a public confession of faith.)"
                },
                {
                    "line_number": 5048,
                    "text": "“I came to speak of something,” Raskolnikov said aloud, frowning. He got up and went to Sonia. She lifted her eyes to him in silence. His face was particularly stern and there was a sort of savage determination in it."
                },
                {
                    "line_number": 5052,
                    "text": "“What for?” asked Sonia amazed. Her recent meeting with his mother and sister had left a great impression which she could not analyse. She heard his news almost with horror."
                },
                {
                    "line_number": 5056,
                    "text": "His eyes glittered “as though he were mad,” Sonia thought, in her turn."
                },
                {
                    "line_number": 5066,
                    "text": "“I don’t understand,” whispered Sonia."
                },
                {
                    "line_number": 5070,
                    "text": "“What for? What’s all this for?” said Sonia, strangely and violently agitated by his words."
                },
                {
                    "line_number": 5074,
                    "text": "“What’s to be done, what’s to be done?” repeated Sonia, weeping hysterically and wringing her hands."
                },
                {
                    "line_number": 5078,
                    "text": "Sonia started with terror."
                },
                {
                    "line_number": 5084,
                    "text": "He went out. Sonia gazed at him as at a madman. But she herself was like one insane and felt it. Her head was going round."
                },
                {
                    "line_number": 5088,
                    "text": "Sonia spent the whole night feverish and delirious. She jumped up from time to time, wept and wrung her hands, then sank again into feverish sleep and dreamt of Polenka, Katerina Ivanovna and Lizaveta, of reading the gospel and him... him with pale face, with burning eyes... kissing her feet, weeping."
                },
                {
                    "line_number": 5090,
                    "text": "On the other side of the door on the right, which divided Sonia’s room from Madame Resslich’s flat, was a room which had long stood empty. A card was fixed on the gate and a notice stuck in the windows over the canal advertising it to let. Sonia had long been accustomed to the room’s being uninhabited. But all that time Mr. Svidrigaïlov had been standing, listening at the door of the empty room. When Raskolnikov went out he stood still, thought a moment, went on tiptoe to his own room which adjoined the empty one, brought a chair and noiselessly carried it to the door that led to Sonia’s room. The conversation had struck him as interesting and remarkable, and he had greatly enjoyed it—so much so that he brought a chair that he might not in the future, to-morrow, for instance, have to endure the inconvenience of standing a whole hour, but might listen in comfort."
                },
                {
                    "line_number": 5440,
                    "text": "He had a sort of presentiment that for to-day, at least, he might consider himself out of danger. He had a sudden sense almost of joy; he wanted to make haste to Katerina Ivanovna’s. He would be too late for the funeral, of course, but he would be in time for the memorial dinner, and there at once he would see Sonia."
                },
                {
                    "line_number": 5618,
                    "text": "Five minutes later Lebeziatnikov came in with Sonia. She came in very much surprised and overcome with shyness as usual. She was always shy in such circumstances and was always afraid of new people, she had been as a child and was even more so now.... Pyotr Petrovitch met her “politely and affably,” but with a certain shade of bantering familiarity which in his opinion was suitable for a man of his respectability and weight in dealing with a creature so young and so interesting as she. He hastened to “reassure” her and made her sit down facing him at the table. Sonia sat down, looked about her—at Lebeziatnikov, at the notes lying on the table and then again at Pyotr Petrovitch and her eyes remained riveted on him. Lebeziatnikov was moving to the door. Pyotr Petrovitch signed to Sonia to remain seated and stopped Lebeziatnikov."
                },
                {
                    "line_number": 5628,
                    "text": "Pyotr Petrovitch returned to the sofa, sat down opposite Sonia, looked attentively at her and assumed an extremely dignified, even severe expression, as much as to say, “don’t you make any mistake, madam.” Sonia was overwhelmed with embarrassment."
                },
                {
                    "line_number": 5634,
                    "text": "“Quite so, yes; the place of a mother,” Sonia answered, timidly and hurriedly."
                },
                {
                    "line_number": 5640,
                    "text": "And Sonia hastily jumped up from her seat."
                },
                {
                    "line_number": 5644,
                    "text": "Sonia sat down hurriedly. Her eyes rested again for an instant on the grey-and-rainbow-coloured notes that remained on the table, but she quickly looked away and fixed her eyes on Pyotr Petrovitch. She felt it horribly indecorous, especially for her, to look at another person’s money. She stared at the gold eye-glass which Pyotr Petrovitch held in his left hand and at the massive and extremely handsome ring with a yellow stone on his middle finger. But suddenly she looked away and, not knowing where to turn, ended by staring Pyotr Petrovitch again straight in the face. After a pause of still greater dignity he continued."
                },
                {
                    "line_number": 5648,
                    "text": "“Yes... preternatural...” Sonia hurriedly assented."
                },
                {
                    "line_number": 5656,
                    "text": "“Allow me to ask,” Sonia rose to her feet, “did you say something to her yesterday of the possibility of a pension? Because she told me you had undertaken to get her one. Was that true?”"
                },
                {
                    "line_number": 5660,
                    "text": "“Yes, she is. For she is credulous and good-hearted, and she believes everything from the goodness of her heart and... and... and she is like that... yes... You must excuse her,” said Sonia, and again she got up to go."
                },
                {
                    "line_number": 5664,
                    "text": "“No, I haven’t heard,” muttered Sonia."
                },
                {
                    "line_number": 5670,
                    "text": "“Yes, yes... God will repay you for it,” faltered Sonia, gazing intently at Pyotr Petrovitch."
                },
                {
                    "line_number": 5676,
                    "text": "Sonia burst into tears."
                },
                {
                    "line_number": 5680,
                    "text": "And Pyotr Petrovitch held out to Sonia a ten-rouble note carefully unfolded. Sonia took it, flushed crimson, jumped up, muttered something and began taking leave. Pyotr Petrovitch accompanied her ceremoniously to the door. She got out of the room at last, agitated and distressed, and returned to Katerina Ivanovna, overwhelmed with confusion."
                },
                {
                    "line_number": 5682,
                    "text": "All this time Lebeziatnikov had stood at the window or walked about the room, anxious not to interrupt the conversation; when Sonia had gone he walked up to Pyotr Petrovitch and solemnly held out his hand."
                },
                {
                    "line_number": 5699,
                    "text": "It would be difficult to explain exactly what could have originated the idea of that senseless dinner in Katerina Ivanovna’s disordered brain. Nearly ten of the twenty roubles, given by Raskolnikov for Marmeladov’s funeral, were wasted upon it. Possibly Katerina Ivanovna felt obliged to honour the memory of the deceased “suitably,” that all the lodgers, and still more Amalia Ivanovna, might know “that he was in no way their inferior, and perhaps very much their superior,” and that no one had the right “to turn up his nose at him.” Perhaps the chief element was that peculiar “poor man’s pride,” which compels many poor people to spend their last savings on some traditional social ceremony, simply in order to do “like other people,” and not to “be looked down upon.” It is very probable, too, that Katerina Ivanovna longed on this occasion, at the moment when she seemed to be abandoned by everyone, to show those “wretched contemptible lodgers” that she knew “how to do things, how to entertain” and that she had been brought up “in a genteel, she might almost say aristocratic colonel’s family” and had not been meant for sweeping floors and washing the children’s rags at night. Even the poorest and most broken-spirited people are sometimes liable to these paroxysms of pride and vanity which take the form of an irresistible nervous craving. And Katerina Ivanovna was not broken-spirited; she might have been killed by circumstance, but her spirit could not have been broken, that is, she could not have been intimidated, her will could not be crushed. Moreover Sonia had said with good reason that her mind was unhinged. She could not be said to be insane, but for a year past she had been so harassed that her mind might well be overstrained. The later stages of consumption are apt, doctors tell us, to affect the intellect."
                },
                {
                    "line_number": 5705,
                    "text": "Katerina Ivanovna, however, put off expressing her feelings for the time and contented herself with treating her coldly, though she decided inwardly that she would certainly have to put Amalia Ivanovna down and set her in her proper place, for goodness only knew what she was fancying herself. Katerina Ivanovna was irritated too by the fact that hardly any of the lodgers invited had come to the funeral, except the Pole who had just managed to run into the cemetery, while to the memorial dinner the poorest and most insignificant of them had turned up, the wretched creatures, many of them not quite sober. The older and more respectable of them all, as if by common consent, stayed away. Pyotr Petrovitch Luzhin, for instance, who might be said to be the most respectable of all the lodgers, did not appear, though Katerina Ivanovna had the evening before told all the world, that is Amalia Ivanovna, Polenka, Sonia and the Pole, that he was the most generous, noble-hearted man with a large property and vast connections, who had been a friend of her first husband’s, and a guest in her father’s house, and that he had promised to use all his influence to secure her a considerable pension. It must be noted that when Katerina Ivanovna exalted anyone’s connections and fortune, it was without any ulterior motive, quite disinterestedly, for the mere pleasure of adding to the consequence of the person praised. Probably “taking his cue” from Luzhin, “that contemptible wretch Lebeziatnikov had not turned up either. What did he fancy himself? He was only asked out of kindness and because he was sharing the same room with Pyotr Petrovitch and was a friend of his, so that it would have been awkward not to invite him.”"
                },
                {
                    "line_number": 5719,
                    "text": "“Do you know, I gave her the most delicate instructions, so to speak, for inviting that lady and her daughter, you understand of whom I am speaking? It needed the utmost delicacy, the greatest nicety, but she has managed things so that that fool, that conceited baggage, that provincial nonentity, simply because she is the widow of a major, and has come to try and get a pension and to fray out her skirts in the government offices, because at fifty she paints her face (everybody knows it)... a creature like that did not think fit to come, and has not even answered the invitation, which the most ordinary good manners required! I can’t understand why Pyotr Petrovitch has not come? But where’s Sonia? Where has she gone? Ah, there she is at last! what is it, Sonia, where have you been? It’s odd that even at your father’s funeral you should be so unpunctual. Rodion Romanovitch, make room for her beside you. That’s your place, Sonia... take what you like. Have some of the cold entrée with jelly, that’s the best. They’ll bring the pancakes directly. Have they given the children some? Polenka, have you got everything? (Cough-cough-cough.) That’s all right. Be a good girl, Lida, and, Kolya, don’t fidget with your feet; sit like a little gentleman. What are you saying, Sonia?”"
                },
                {
                    "line_number": 5721,
                    "text": "Sonia hastened to give her Pyotr Petrovitch’s apologies, trying to speak loud enough for everyone to hear and carefully choosing the most respectful phrases which she attributed to Pyotr Petrovitch. She added that Pyotr Petrovitch had particularly told her to say that, as soon as he possibly could, he would come immediately to discuss business alone with her and to consider what could be done for her, etc., etc."
                },
                {
                    "line_number": 5723,
                    "text": "Sonia knew that this would comfort Katerina Ivanovna, would flatter her and gratify her pride. She sat down beside Raskolnikov; she made him a hurried bow, glancing curiously at him. But for the rest of the time she seemed to avoid looking at him or speaking to him. She seemed absent-minded, though she kept looking at Katerina Ivanovna, trying to please her. Neither she nor Katerina Ivanovna had been able to get mourning; Sonia was wearing dark brown, and Katerina Ivanovna had on her only dress, a dark striped cotton one."
                },
                {
                    "line_number": 5725,
                    "text": "The message from Pyotr Petrovitch was very successful. Listening to Sonia with dignity, Katerina Ivanovna inquired with equal dignity how Pyotr Petrovitch was, then at once whispered almost aloud to Raskolnikov that it certainly would have been strange for a man of Pyotr Petrovitch’s position and standing to find himself in such “extraordinary company,” in spite of his devotion to her family and his old friendship with her father."
                },
                {
                    "line_number": 5753,
                    "text": "Raskolnikov sat in silence, listening with disgust. He only ate from politeness, just tasting the food that Katerina Ivanovna was continually putting on his plate, to avoid hurting her feelings. He watched Sonia intently. But Sonia became more and more anxious and distressed; she, too, foresaw that the dinner would not end peaceably, and saw with terror Katerina Ivanovna’s growing irritation. She knew that she, Sonia, was the chief reason for the ‘genteel’ ladies’ contemptuous treatment of Katerina Ivanovna’s invitation. She had heard from Amalia Ivanovna that the mother was positively offended at the invitation and had asked the question: “How could she let her daughter sit down beside that young person?” Sonia had a feeling that Katerina Ivanovna had already heard this and an insult to Sonia meant more to Katerina Ivanovna than an insult to herself, her children, or her father, Sonia knew that Katerina Ivanovna would not be satisfied now, “till she had shown those draggletails that they were both...” To make matters worse someone passed Sonia, from the other end of the table, a plate with two hearts pierced with an arrow, cut out of black bread. Katerina Ivanovna flushed crimson and at once said aloud across the table that the man who sent it was “a drunken ass!”"
                },
                {
                    "line_number": 5761,
                    "text": "Warming up, Katerina Ivanovna proceeded to enlarge on the peaceful and happy life they would lead in T——, on the gymnasium teachers whom she would engage to give lessons in her boarding-school, one a most respectable old Frenchman, one Mangot, who had taught Katerina Ivanovna herself in old days and was still living in T——, and would no doubt teach in her school on moderate terms. Next she spoke of Sonia who would go with her to T—— and help her in all her plans. At this someone at the further end of the table gave a sudden guffaw."
                },
                {
                    "line_number": 5763,
                    "text": "Though Katerina Ivanovna tried to appear to be disdainfully unaware of it, she raised her voice and began at once speaking with conviction of Sonia’s undoubted ability to assist her, of “her gentleness, patience, devotion, generosity and good education,” tapping Sonia on the cheek and kissing her warmly twice. Sonia flushed crimson, and Katerina Ivanovna suddenly burst into tears, immediately observing that she was “nervous and silly, that she was too much upset, that it was time to finish, and as the dinner was over, it was time to hand round the tea.”"
                },
                {
                    "line_number": 5775,
                    "text": "At this Amalia Ivanovna, lashed to fury, struck the table with her fist, and shrieked that she was Amalia Ivanovna, and not Ludwigovna, “that her Vater was named Johann and that he was a burgomeister, and that Katerina Ivanovna’s Vater was quite never a burgomeister.” Katerina Ivanovna rose from her chair, and with a stern and apparently calm voice (though she was pale and her chest was heaving) observed that “if she dared for one moment to set her contemptible wretch of a father on a level with her papa, she, Katerina Ivanovna, would tear her cap off her head and trample it under foot.” Amalia Ivanovna ran about the room, shouting at the top of her voice, that she was mistress of the house and that Katerina Ivanovna should leave the lodgings that minute; then she rushed for some reason to collect the silver spoons from the table. There was a great outcry and uproar, the children began crying. Sonia ran to restrain Katerina Ivanovna, but when Amalia Ivanovna shouted something about “the yellow ticket,” Katerina Ivanovna pushed Sonia away, and rushed at the landlady to carry out her threat."
                },
                {
                    "line_number": 5784,
                    "text": "Pyotr Petrovitch, edging by her, went to the opposite corner where Sonia was."
                },
                {
                    "line_number": 5786,
                    "text": "Katerina Ivanovna remained standing where she was, as though thunderstruck. She could not understand how Pyotr Petrovitch could deny having enjoyed her father’s hospitality. Though she had invented it herself, she believed in it firmly by this time. She was struck too by the businesslike, dry and even contemptuous menacing tone of Pyotr Petrovitch. All the clamour gradually died away at his entrance. Not only was this “serious business man” strikingly incongruous with the rest of the party, but it was evident, too, that he had come upon some matter of consequence, that some exceptional cause must have brought him and that therefore something was going to happen. Raskolnikov, standing beside Sonia, moved aside to let him pass; Pyotr Petrovitch did not seem to notice him. A minute later Lebeziatnikov, too, appeared in the doorway; he did not come in, but stood still, listening with marked interest, almost wonder, and seemed for a time perplexed."
                },
                {
                    "line_number": 5788,
                    "text": "“Excuse me for possibly interrupting you, but it’s a matter of some importance,” Pyotr Petrovitch observed, addressing the company generally. “I am glad indeed to find other persons present. Amalia Ivanovna, I humbly beg you as mistress of the house to pay careful attention to what I have to say to Sofya Ivanovna. Sofya Ivanovna,” he went on, addressing Sonia, who was very much surprised and already alarmed, “immediately after your visit I found that a hundred-rouble note was missing from my table, in the room of my friend Mr. Lebeziatnikov. If in any way whatever you know and will tell us where it is now, I assure you on my word of honour and call all present to witness that the matter shall end there. In the opposite case I shall be compelled to have recourse to very serious measures and then... you must blame yourself.”"
                },
                {
                    "line_number": 5790,
                    "text": "Complete silence reigned in the room. Even the crying children were still. Sonia stood deadly pale, staring at Luzhin and unable to say a word. She seemed not to understand. Some seconds passed."
                },
                {
                    "line_number": 5794,
                    "text": "“I don’t know.... I know nothing about it,” Sonia articulated faintly at last."
                },
                {
                    "line_number": 5798,
                    "text": "“I have taken nothing,” Sonia whispered in terror, “you gave me ten roubles, here it is, take it.”"
                },
                {
                    "line_number": 5800,
                    "text": "Sonia pulled her handkerchief out of her pocket, untied a corner of it, took out the ten-rouble note and gave it to Luzhin."
                },
                {
                    "line_number": 5804,
                    "text": "Sonia looked about her. All were looking at her with such awful, stern, ironical, hostile eyes. She looked at Raskolnikov... he stood against the wall, with his arms crossed, looking at her with glowing eyes."
                },
                {
                    "line_number": 5806,
                    "text": "“Good God!” broke from Sonia."
                },
                {
                    "line_number": 5816,
                    "text": "“What!” cried Katerina Ivanovna, suddenly realising the position, and she rushed at Luzhin. “What! You accuse her of stealing? Sonia? Ah, the wretches, the wretches!”"
                },
                {
                    "line_number": 5818,
                    "text": "And running to Sonia she flung her wasted arms round her and held her as in a vise."
                },
                {
                    "line_number": 5820,
                    "text": "“Sonia! how dared you take ten roubles from him? Foolish girl! Give it to me! Give me the ten roubles at once—here!”"
                },
                {
                    "line_number": 5822,
                    "text": "And snatching the note from Sonia, Katerina Ivanovna crumpled it up and flung it straight into Luzhin’s face. It hit him in the eye and fell on the ground. Amalia Ivanovna hastened to pick it up. Pyotr Petrovitch lost his temper."
                },
                {
                    "line_number": 5828,
                    "text": "“What! Mad? Am I mad? Idiot!” shrieked Katerina Ivanovna. “You are an idiot yourself, pettifogging lawyer, base man! Sonia, Sonia take his money! Sonia a thief! Why, she’d give away her last penny!” and Katerina Ivanovna broke into hysterical laughter. “Did you ever see such an idiot?” she turned from side to side. “And you too?” she suddenly saw the landlady, “and you too, sausage eater, you declare that she is a thief, you trashy Prussian hen’s leg in a crinoline! She hasn’t been out of this room: she came straight from you, you wretch, and sat down beside me, everyone saw her. She sat here, by Rodion Romanovitch. Search her! Since she’s not left the room, the money would have to be on her! Search her, search her! But if you don’t find it, then excuse me, my dear fellow, you’ll answer for it! I’ll go to our Sovereign, to our Sovereign, to our gracious Tsar himself, and throw myself at his feet, to-day, this minute! I am alone in the world! They would let me in! Do you think they wouldn’t? You’re wrong, I will get in! I will get in! You reckoned on her meekness! You relied upon that! But I am not so submissive, let me tell you! You’ve gone too far yourself. Search her, search her!”"
                },
                {
                    "line_number": 5830,
                    "text": "And Katerina Ivanovna in a frenzy shook Luzhin and dragged him towards Sonia."
                },
                {
                    "line_number": 5834,
                    "text": "“As you will! Let anyone who likes search her!” cried Katerina Ivanovna. “Sonia, turn out your pockets! See! Look, monster, the pocket is empty, here was her handkerchief! Here is the other pocket, look! D’you see, d’you see?”"
                },
                {
                    "line_number": 5840,
                    "text": "Exclamations arose on all sides. Raskolnikov was silent, keeping his eyes fixed on Sonia, except for an occasional rapid glance at Luzhin. Sonia stood still, as though unconscious. She was hardly able to feel surprise. Suddenly the colour rushed to her cheeks; she uttered a cry and hid her face in her hands."
                },
                {
                    "line_number": 5844,
                    "text": "“Sonia! Sonia! I don’t believe it! You see, I don’t believe it!” she cried in the face of the obvious fact, swaying her to and fro in her arms like a baby, kissing her face continually, then snatching at her hands and kissing them, too, “you took it! How stupid these people are! Oh dear! You are fools, fools,” she cried, addressing the whole room, “you don’t know, you don’t know what a heart she has, what a girl she is! She take it, she? She’d sell her last rag, she’d go barefoot to help you if you needed it, that’s what she is! She has the yellow passport because my children were starving, she sold herself for us! Ah, husband, husband! Do you see? Do you see? What a memorial dinner for you! Merciful heavens! Defend her, why are you all standing still? Rodion Romanovitch, why don’t you stand up for her? Do you believe it, too? You are not worth her little finger, all of you together! Good God! Defend her now, at least!”"
                },
                {
                    "line_number": 5848,
                    "text": "“Madam, madam, this incident does not reflect upon you!” he cried impressively, “no one would take upon himself to accuse you of being an instigator or even an accomplice in it, especially as you have proved her guilt by turning out her pockets, showing that you had no previous idea of it. I am most ready, most ready to show compassion, if poverty, so to speak, drove Sofya Semyonovna to it, but why did you refuse to confess, mademoiselle? Were you afraid of the disgrace? The first step? You lost your head, perhaps? One can quite understand it.... But how could you have lowered yourself to such an action? Gentlemen,” he addressed the whole company, “gentlemen! Compassionate and, so to say, commiserating these people, I am ready to overlook it even now in spite of the personal insult lavished upon me! And may this disgrace be a lesson to you for the future,” he said, addressing Sonia, “and I will carry the matter no further. Enough!”"
                },
                {
                    "line_number": 5850,
                    "text": "Pyotr Petrovitch stole a glance at Raskolnikov. Their eyes met, and the fire in Raskolnikov’s seemed ready to reduce him to ashes. Meanwhile Katerina Ivanovna apparently heard nothing. She was kissing and hugging Sonia like a madwoman. The children, too, were embracing Sonia on all sides, and Polenka—though she did not fully understand what was wrong—was drowned in tears and shaking with sobs, as she hid her pretty little face, swollen with weeping, on Sonia’s shoulder."
                },
                {
                    "line_number": 5914,
                    "text": "Luzhin smiled contemptuously and did not speak. But he was very pale. He seemed to be deliberating on some means of escape. Perhaps he would have been glad to give up everything and get away, but at the moment this was scarcely possible. It would have implied admitting the truth of the accusations brought against him. Moreover, the company, which had already been excited by drink, was now too much stirred to allow it. The commissariat clerk, though indeed he had not grasped the whole position, was shouting louder than anyone and was making some suggestions very unpleasant to Luzhin. But not all those present were drunk; lodgers came in from all the rooms. The three Poles were tremendously excited and were continually shouting at him: “The pan is a lajdak!” and muttering threats in Polish. Sonia had been listening with strained attention, though she too seemed unable to grasp it all; she seemed as though she had just returned to consciousness. She did not take her eyes off Raskolnikov, feeling that all her safety lay in him. Katerina Ivanovna breathed hard and painfully and seemed fearfully exhausted. Amalia Ivanovna stood looking more stupid than anyone, with her mouth wide open, unable to make out what had happened. She only saw that Pyotr Petrovitch had somehow come to grief."
                },
                {
                    "line_number": 5916,
                    "text": "Raskolnikov was attempting to speak again, but they did not let him. Everyone was crowding round Luzhin with threats and shouts of abuse. But Pyotr Petrovitch was not intimidated. Seeing that his accusation of Sonia had completely failed, he had recourse to insolence:"
                },
                {
                    "line_number": 5924,
                    "text": "He forced his way through. But the commissariat clerk was unwilling to let him off so easily: he picked up a glass from the table, brandished it in the air and flung it at Pyotr Petrovitch; but the glass flew straight at Amalia Ivanovna. She screamed, and the clerk, overbalancing, fell heavily under the table. Pyotr Petrovitch made his way to his room and half an hour later had left the house. Sonia, timid by nature, had felt before that day that she could be ill-treated more easily than anyone, and that she could be wronged with impunity. Yet till that moment she had fancied that she might escape misfortune by care, gentleness and submissiveness before everyone. Her disappointment was too great. She could, of course, bear with patience and almost without murmur anything, even this. But for the first minute she felt it too bitter. In spite of her triumph and her justification—when her first terror and stupefaction had passed and she could understand it all clearly—the feeling of her helplessness and of the wrong done to her made her heart throb with anguish and she was overcome with hysterical weeping. At last, unable to bear any more, she rushed out of the room and ran home, almost immediately after Luzhin’s departure. When amidst loud laughter the glass flew at Amalia Ivanovna, it was more than the landlady could endure. With a shriek she rushed like a fury at Katerina Ivanovna, considering her to blame for everything."
                },
                {
                    "line_number": 5936,
                    "text": "And he set off in the direction of Sonia’s lodgings."
                },
                {
                    "line_number": 5939,
                    "text": "Raskolnikov had been a vigorous and active champion of Sonia against Luzhin, although he had such a load of horror and anguish in his own heart. But having gone through so much in the morning, he found a sort of relief in a change of sensations, apart from the strong personal feeling which impelled him to defend Sonia. He was agitated too, especially at some moments, by the thought of his approaching interview with Sonia: he had to tell her who had killed Lizaveta. He knew the terrible suffering it would be to him and, as it were, brushed away the thought of it. So when he cried as he left Katerina Ivanovna’s, “Well, Sofya Semyonovna, we shall see what you’ll say now!” he was still superficially excited, still vigorous and defiant from his triumph over Luzhin. But, strange to say, by the time he reached Sonia’s lodging, he felt a sudden impotence and fear. He stood still in hesitation at the door, asking himself the strange question: “Must he tell her who killed Lizaveta?” It was a strange question because he felt at the very time not only that he could not help telling her, but also that he could not put off the telling. He did not yet know why it must be so, he only felt it, and the agonising sense of his impotence before the inevitable almost crushed him. To cut short his hesitation and suffering, he quickly opened the door and looked at Sonia from the doorway. She was sitting with her elbows on the table and her face in her hands, but seeing Raskolnikov she got up at once and came to meet him as though she were expecting him."
                },
                {
                    "line_number": 5947,
                    "text": "“Well, Sonia?” he said, and felt that his voice was trembling, “it was all due to ‘your social position and the habits associated with it.’ Did you understand that just now?”"
                },
                {
                    "line_number": 5959,
                    "text": "“My God!” cried Sonia, “let’s go at once....”"
                },
                {
                    "line_number": 5969,
                    "text": "Sonia sat down in painful suspense. Raskolnikov was silent, gazing at the floor and deliberating."
                },
                {
                    "line_number": 5971,
                    "text": "“This time Luzhin did not want to prosecute you,” he began, not looking at Sonia, “but if he had wanted to, if it had suited his plans, he would have sent you to prison if it had not been for Lebeziatnikov and me. Ah?”"
                },
                {
                    "line_number": 5977,
                    "text": "Sonia was silent."
                },
                {
                    "line_number": 5983,
                    "text": "“I thought you would cry out again ‘don’t speak of it, leave off.’” Raskolnikov gave a laugh, but rather a forced one. “What, silence again?” he asked a minute later. “We must talk about something, you know. It would be interesting for me to know how you would decide a certain ‘problem’ as Lebeziatnikov would say.” (He was beginning to lose the thread.) “No, really, I am serious. Imagine, Sonia, that you had known all Luzhin’s intentions beforehand. Known, that is, for a fact, that they would be the ruin of Katerina Ivanovna and the children and yourself thrown in—since you don’t count yourself for anything—Polenka too... for she’ll go the same way. Well, if suddenly it all depended on your decision whether he or they should go on living, that is whether Luzhin should go on living and doing wicked things, or Katerina Ivanovna should die? How would you decide which of them was to die? I ask you?”"
                },
                {
                    "line_number": 5985,
                    "text": "Sonia looked uneasily at him. There was something peculiar in this hesitating question, which seemed approaching something in a roundabout way."
                },
                {
                    "line_number": 5991,
                    "text": "“Why do you ask about what could not happen?” said Sonia reluctantly."
                },
                {
                    "line_number": 5999,
                    "text": "“You’d better say straight out what you want!” Sonia cried in distress. “You are leading up to something again.... Can you have come simply to torture me?”"
                },
                {
                    "line_number": 6003,
                    "text": "“Of course you’re right, Sonia,” he said softly at last. He was suddenly changed. His tone of assumed arrogance and helpless defiance was gone. Even his voice was suddenly weak. “I told you yesterday that I was not coming to ask forgiveness and almost the first thing I’ve said is to ask forgiveness.... I said that about Luzhin and Providence for my own sake. I was asking forgiveness, Sonia....”"
                },
                {
                    "line_number": 6007,
                    "text": "And suddenly a strange, surprising sensation of a sort of bitter hatred for Sonia passed through his heart. As it were wondering and frightened of this sensation, he raised his head and looked intently at her; but he met her uneasy and painfully anxious eyes fixed on him; there was love in them; his hatred vanished like a phantom. It was not the real feeling; he had taken the one feeling for the other. It only meant that that minute had come."
                },
                {
                    "line_number": 6009,
                    "text": "He hid his face in his hands again and bowed his head. Suddenly he turned pale, got up from his chair, looked at Sonia, and without uttering a word sat down mechanically on her bed."
                },
                {
                    "line_number": 6013,
                    "text": "“What’s the matter?” asked Sonia, dreadfully frightened."
                },
                {
                    "line_number": 6015,
                    "text": "He could not utter a word. This was not at all, not at all the way he had intended to “tell” and he did not understand what was happening to him now. She went up to him, softly, sat down on the bed beside him and waited, not taking her eyes off him. Her heart throbbed and sank. It was unendurable; he turned his deadly pale face to her. His lips worked, helplessly struggling to utter something. A pang of terror passed through Sonia’s heart."
                },
                {
                    "line_number": 6019,
                    "text": "“Nothing, Sonia, don’t be frightened.... It’s nonsense. It really is nonsense, if you think of it,” he muttered, like a man in delirium. “Why have I come to torture you?” he added suddenly, looking at her. “Why, really? I keep asking myself that question, Sonia....”"
                },
                {
                    "line_number": 6025,
                    "text": "“It’s all nonsense.... Listen, Sonia.” He suddenly smiled, a pale helpless smile for two seconds. “You remember what I meant to tell you yesterday?”"
                },
                {
                    "line_number": 6027,
                    "text": "Sonia waited uneasily."
                },
                {
                    "line_number": 6037,
                    "text": "Sonia’s face grew paler and paler, and she breathed painfully."
                },
                {
                    "line_number": 6063,
                    "text": "“N-no...” whispered Sonia."
                },
                {
                    "line_number": 6067,
                    "text": "As soon as he had said this again, the same familiar sensation froze his heart. He looked at her and all at once seemed to see in her face the face of Lizaveta. He remembered clearly the expression in Lizaveta’s face, when he approached her with the axe and she stepped back to the wall, putting out her hand, with childish terror in her face, looking as little children do when they begin to be frightened of something, looking intently and uneasily at what frightens them, shrinking back and holding out their little hands on the point of crying. Almost the same thing happened now to Sonia. With the same helplessness and the same terror, she looked at him for a while and, suddenly putting out her left hand, pressed her fingers faintly against his breast and slowly began to get up from the bed, moving further from him and keeping her eyes fixed even more immovably on him. Her terror infected him. The same fear showed itself on his face. In the same way he stared at her and almost with the same childish smile."
                },
                {
                    "line_number": 6075,
                    "text": "“Stop, Sonia, enough! don’t torture me,” he begged her miserably."
                },
                {
                    "line_number": 6085,
                    "text": "“You are a strange girl, Sonia—you kiss me and hug me when I tell you about that.... You don’t think what you are doing.”"
                },
                {
                    "line_number": 6091,
                    "text": "“Then you won’t leave me, Sonia?” he said, looking at her almost with hope."
                },
                {
                    "line_number": 6093,
                    "text": "“No, no, never, nowhere!” cried Sonia. “I will follow you, I will follow you everywhere. Oh, my God! Oh, how miserable I am!... Why, why didn’t I know you before! Why didn’t you come before? Oh, dear!”"
                },
                {
                    "line_number": 6101,
                    "text": "“Perhaps I don’t want to go to Siberia yet, Sonia,” he said."
                },
                {
                    "line_number": 6103,
                    "text": "Sonia looked at him quickly."
                },
                {
                    "line_number": 6109,
                    "text": "“Oh, well—to plunder. Leave off, Sonia,” he answered wearily, almost with vexation."
                },
                {
                    "line_number": 6111,
                    "text": "Sonia stood as though struck dumb, but suddenly she cried:"
                },
                {
                    "line_number": 6115,
                    "text": "“No, Sonia, no,” he muttered, turning away and hanging his head. “I was not so hungry.... I certainly did want to help my mother, but... that’s not the real thing either.... Don’t torture me, Sonia.”"
                },
                {
                    "line_number": 6117,
                    "text": "Sonia clasped her hands."
                },
                {
                    "line_number": 6121,
                    "text": "“No, Sonia,” he broke in hurriedly, “that money was not it. Don’t worry yourself! That money my mother sent me and it came when I was ill, the day I gave it to you.... Razumihin saw it... he received it for me.... That money was mine—my own.”"
                },
                {
                    "line_number": 6123,
                    "text": "Sonia listened to him in bewilderment and did her utmost to comprehend."
                },
                {
                    "line_number": 6127,
                    "text": "Sonia strained every nerve to listen."
                },
                {
                    "line_number": 6133,
                    "text": "The thought flashed through Sonia’s mind, wasn’t he mad? But she dismissed it at once. “No, it was something else.” She could make nothing of it, nothing."
                },
                {
                    "line_number": 6135,
                    "text": "“Do you know, Sonia,” he said suddenly with conviction, “let me tell you: if I’d simply killed because I was hungry,” laying stress on every word and looking enigmatically but sincerely at her, “I should be happy now. You must believe that! What would it matter to you,” he cried a moment later with a sort of despair, “what would it matter to you if I were to confess that I did wrong? What do you gain by such a stupid triumph over me? Ah, Sonia, was it for that I’ve come to you to-day?”"
                },
                {
                    "line_number": 6137,
                    "text": "Again Sonia tried to say something, but did not speak."
                },
                {
                    "line_number": 6141,
                    "text": "“Go where?” asked Sonia timidly."
                },
                {
                    "line_number": 6143,
                    "text": "“Not to steal and not to murder, don’t be anxious,” he smiled bitterly. “We are so different.... And you know, Sonia, it’s only now, only this moment that I understand where I asked you to go with me yesterday! Yesterday when I said it I did not know where. I asked you for one thing, I came to you for one thing—not to leave me. You won’t leave me, Sonia?”"
                },
                {
                    "line_number": 6147,
                    "text": "“And why, why did I tell her? Why did I let her know?” he cried a minute later in despair, looking with infinite anguish at her. “Here you expect an explanation from me, Sonia; you are sitting and waiting for it, I see that. But what can I tell you? You won’t understand and will only suffer misery... on my account! Well, you are crying and embracing me again. Why do you do it? Because I couldn’t bear my burden and have come to throw it on another: you suffer too, and I shall feel better! And can you love such a mean wretch?”"
                },
                {
                    "line_number": 6149,
                    "text": "“But aren’t you suffering, too?” cried Sonia."
                },
                {
                    "line_number": 6153,
                    "text": "“Sonia, I have a bad heart, take note of that. It may explain a great deal. I have come because I am bad. There are men who wouldn’t have come. But I am a coward and... a mean wretch. But... never mind! That’s not the point. I must speak now, but I don’t know how to begin.”"
                },
                {
                    "line_number": 6159,
                    "text": "“No, no, it was a good thing you came,” cried Sonia. “It’s better I should know, far better!”"
                },
                {
                    "line_number": 6165,
                    "text": "“N-no,” Sonia whispered naïvely and timidly. “Only speak, speak, I shall understand, I shall understand in myself!” she kept begging him."
                },
                {
                    "line_number": 6169,
                    "text": "“It was like this: I asked myself one day this question—what if Napoleon, for instance, had happened to be in my place, and if he had not had Toulon nor Egypt nor the passage of Mont Blanc to begin his career with, but instead of all those picturesque and monumental things, there had simply been some ridiculous old hag, a pawnbroker, who had to be murdered too to get money from her trunk (for his career, you understand). Well, would he have brought himself to that if there had been no other means? Wouldn’t he have felt a pang at its being so far from monumental and... and sinful, too? Well, I must tell you that I worried myself fearfully over that ‘question’ so that I was awfully ashamed when I guessed at last (all of a sudden, somehow) that it would not have given him the least pang, that it would not even have struck him that it was not monumental... that he would not have seen that there was anything in it to pause over, and that, if he had had no other way, he would have strangled her in a minute without thinking about it! Well, I too... left off thinking about it... murdered her, following his example. And that’s exactly how it was! Do you think it funny? Yes, Sonia, the funniest thing of all is that perhaps that’s just how it was.”"
                },
                {
                    "line_number": 6171,
                    "text": "Sonia did not think it at all funny."
                },
                {
                    "line_number": 6177,
                    "text": "“You are right again, Sonia. Of course that’s all nonsense, it’s almost all talk! You see, you know of course that my mother has scarcely anything, my sister happened to have a good education and was condemned to drudge as a governess. All their hopes were centered on me. I was a student, but I couldn’t keep myself at the university and was forced for a time to leave it. Even if I had lingered on like that, in ten or twelve years I might (with luck) hope to be some sort of teacher or clerk with a salary of a thousand roubles” (he repeated it as though it were a lesson) “and by that time my mother would be worn out with grief and anxiety and I could not succeed in keeping her in comfort while my sister... well, my sister might well have fared worse! And it’s a hard thing to pass everything by all one’s life, to turn one’s back upon everything, to forget one’s mother and decorously accept the insults inflicted on one’s sister. Why should one? When one has buried them to burden oneself with others—wife and children—and to leave them again without a farthing? So I resolved to gain possession of the old woman’s money and to use it for my first years without worrying my mother, to keep myself at the university and for a little while after leaving it—and to do this all on a broad, thorough scale, so as to build up a completely new career and enter upon a new life of independence.... Well... that’s all.... Well, of course in killing the old woman I did wrong.... Well, that’s enough.”"
                },
                {
                    "line_number": 6181,
                    "text": "“Oh, that’s not it, that’s not it,” Sonia cried in distress. “How could one... no, that’s not right, not right.”"
                },
                {
                    "line_number": 6187,
                    "text": "“I’ve only killed a louse, Sonia, a useless, loathsome, harmful creature.”"
                },
                {
                    "line_number": 6191,
                    "text": "“I too know it wasn’t a louse,” he answered, looking strangely at her. “But I am talking nonsense, Sonia,” he added. “I’ve been talking nonsense a long time.... That’s not it, you are right there. There were quite, quite other causes for it! I haven’t talked to anyone for so long, Sonia.... My head aches dreadfully now.”"
                },
                {
                    "line_number": 6193,
                    "text": "His eyes shone with feverish brilliance. He was almost delirious; an uneasy smile strayed on his lips. His terrible exhaustion could be seen through his excitement. Sonia saw how he was suffering. She too was growing dizzy. And he talked so strangely; it seemed somehow comprehensible, but yet... “But how, how! Good God!” And she wrung her hands in despair."
                },
                {
                    "line_number": 6195,
                    "text": "“No, Sonia, that’s not it,” he began again suddenly, raising his head, as though a new and sudden train of thought had struck and as it were roused him—“that’s not it! Better... imagine—yes, it’s certainly better—imagine that I am vain, envious, malicious, base, vindictive and... well, perhaps with a tendency to insanity. (Let’s have it all out at once! They’ve talked of madness already, I noticed.) I told you just now I could not keep myself at the university. But do you know that perhaps I might have done? My mother would have sent me what I needed for the fees and I could have earned enough for clothes, boots and food, no doubt. Lessons had turned up at half a rouble. Razumihin works! But I turned sulky and wouldn’t. (Yes, sulkiness, that’s the right word for it!) I sat in my room like a spider. You’ve been in my den, you’ve seen it.... And do you know, Sonia, that low ceilings and tiny rooms cramp the soul and the mind? Ah, how I hated that garret! And yet I wouldn’t go out of it! I wouldn’t on purpose! I didn’t go out for days together, and I wouldn’t work, I wouldn’t even eat, I just lay there doing nothing. If Nastasya brought me anything, I ate it, if she didn’t, I went all day without; I wouldn’t ask, on purpose, from sulkiness! At night I had no light, I lay in the dark and I wouldn’t earn money for candles. I ought to have studied, but I sold my books; and the dust lies an inch thick on the notebooks on my table. I preferred lying still and thinking. And I kept thinking.... And I had dreams all the time, strange dreams of all sorts, no need to describe! Only then I began to fancy that... No, that’s not it! Again I am telling you wrong! You see I kept asking myself then: why am I so stupid that if others are stupid—and I know they are—yet I won’t be wiser? Then I saw, Sonia, that if one waits for everyone to get wiser it will take too long.... Afterwards I understood that that would never come to pass, that men won’t change and that nobody can alter it and that it’s not worth wasting effort over it. Yes, that’s so. That’s the law of their nature, Sonia,... that’s so!... And I know now, Sonia, that whoever is strong in mind and spirit will have power over them. Anyone who is greatly daring is right in their eyes. He who despises most things will be a lawgiver among them and he who dares most of all will be most in the right! So it has been till now and so it will always be. A man must be blind not to see it!”"
                },
                {
                    "line_number": 6197,
                    "text": "Though Raskolnikov looked at Sonia as he said this, he no longer cared whether she understood or not. The fever had complete hold of him; he was in a sort of gloomy ecstasy (he certainly had been too long without talking to anyone). Sonia felt that his gloomy creed had become his faith and code."
                },
                {
                    "line_number": 6199,
                    "text": "“I divined then, Sonia,” he went on eagerly, “that power is only vouchsafed to the man who dares to stoop and pick it up. There is only one thing, one thing needful: one has only to dare! Then for the first time in my life an idea took shape in my mind which no one had ever thought of before me, no one! I saw clear as daylight how strange it is that not a single person living in this mad world has had the daring to go straight for it all and send it flying to the devil! I... I wanted to have the daring... and I killed her. I only wanted to have the daring, Sonia! That was the whole cause of it!”"
                },
                {
                    "line_number": 6201,
                    "text": "“Oh hush, hush,” cried Sonia, clasping her hands. “You turned away from God and God has smitten you, has given you over to the devil!”"
                },
                {
                    "line_number": 6203,
                    "text": "“Then Sonia, when I used to lie there in the dark and all this became clear to me, was it a temptation of the devil, eh?”"
                },
                {
                    "line_number": 6207,
                    "text": "“Hush, Sonia! I am not laughing. I know myself that it was the devil leading me. Hush, Sonia, hush!” he repeated with gloomy insistence. “I know it all, I have thought it all over and over and whispered it all over to myself, lying there in the dark.... I’ve argued it all over with myself, every point of it, and I know it all, all! And how sick, how sick I was then of going over it all! I have kept wanting to forget it and make a new beginning, Sonia, and leave off thinking. And you don’t suppose that I went into it headlong like a fool? I went into it like a wise man, and that was just my destruction. And you mustn’t suppose that I didn’t know, for instance, that if I began to question myself whether I had the right to gain power—I certainly hadn’t the right—or that if I asked myself whether a human being is a louse it proved that it wasn’t so for me, though it might be for a man who would go straight to his goal without asking questions.... If I worried myself all those days, wondering whether Napoleon would have done it or not, I felt clearly of course that I wasn’t Napoleon. I had to endure all the agony of that battle of ideas, Sonia, and I longed to throw it off: I wanted to murder without casuistry, to murder for my own sake, for myself alone! I didn’t want to lie about it even to myself. It wasn’t to help my mother I did the murder—that’s nonsense—I didn’t do the murder to gain wealth and power and to become a benefactor of mankind. Nonsense! I simply did it; I did the murder for myself, for myself alone, and whether I became a benefactor to others, or spent my life like a spider catching men in my web and sucking the life out of men, I couldn’t have cared at that moment.... And it was not the money I wanted, Sonia, when I did it. It was not so much the money I wanted, but something else.... I know it all now.... Understand me! Perhaps I should never have committed a murder again. I wanted to find out something else; it was something else led me on. I wanted to find out then and quickly whether I was a louse like everybody else or a man. Whether I can step over barriers or not, whether I dare stoop to pick up or not, whether I am a trembling creature or whether I have the right...”"
                },
                {
                    "line_number": 6209,
                    "text": "“To kill? Have the right to kill?” Sonia clasped her hands."
                },
                {
                    "line_number": 6211,
                    "text": "“Ach, Sonia!” he cried irritably and seemed about to make some retort, but was contemptuously silent. “Don’t interrupt me, Sonia. I want to prove one thing only, that the devil led me on then and he has shown me since that I had not the right to take that path, because I am just such a louse as all the rest. He was mocking me and here I’ve come to you now! Welcome your guest! If I were not a louse, should I have come to you? Listen: when I went then to the old woman’s I only went to try.... You may be sure of that!”"
                },
                {
                    "line_number": 6215,
                    "text": "“But how did I murder her? Is that how men do murders? Do men go to commit a murder as I went then? I will tell you some day how I went! Did I murder the old woman? I murdered myself, not her! I crushed myself once for all, for ever.... But it was the devil that killed that old woman, not I. Enough, enough, Sonia, enough! Let me be!” he cried in a sudden spasm of agony, “let me be!”"
                },
                {
                    "line_number": 6219,
                    "text": "“What suffering!” A wail of anguish broke from Sonia."
                },
                {
                    "line_number": 6227,
                    "text": "“You mean Siberia, Sonia? I must give myself up?” he asked gloomily."
                },
                {
                    "line_number": 6231,
                    "text": "“No! I am not going to them, Sonia!”"
                },
                {
                    "line_number": 6233,
                    "text": "“But how will you go on living? What will you live for?” cried Sonia, “how is it possible now? Why, how can you talk to your mother? (Oh, what will become of them now?) But what am I saying? You have abandoned your mother and your sister already. He has abandoned them already! Oh, God!” she cried, “why, he knows it all himself. How, how can he live by himself! What will become of you now?”"
                },
                {
                    "line_number": 6235,
                    "text": "“Don’t be a child, Sonia,” he said softly. “What wrong have I done them? Why should I go to them? What should I say to them? That’s only a phantom.... They destroy men by millions themselves and look on it as a virtue. They are knaves and scoundrels, Sonia! I am not going to them. And what should I say to them—that I murdered her, but did not dare to take the money and hid it under a stone?” he added with a bitter smile. “Why, they would laugh at me, and would call me a fool for not getting it. A coward and a fool! They wouldn’t understand and they don’t deserve to understand. Why should I go to them? I won’t. Don’t be a child, Sonia....”"
                },
                {
                    "line_number": 6247,
                    "text": "“Ach!” Sonia cried in terror."
                },
                {
                    "line_number": 6249,
                    "text": "“Well, why do you cry out? You want me to go to Siberia and now you are frightened? But let me tell you: I shall not give myself up. I shall make a struggle for it and they won’t do anything to me. They’ve no real evidence. Yesterday I was in great danger and believed I was lost; but to-day things are going better. All the facts they know can be explained two ways, that’s to say I can turn their accusations to my credit, do you understand? And I shall, for I’ve learnt my lesson. But they will certainly arrest me. If it had not been for something that happened, they would have done so to-day for certain; perhaps even now they will arrest me to-day.... But that’s no matter, Sonia; they’ll let me out again... for there isn’t any real proof against me, and there won’t be, I give you my word for it. And they can’t convict a man on what they have against me. Enough.... I only tell you that you may know.... I will try to manage somehow to put it to my mother and sister so that they won’t be frightened.... My sister’s future is secure, however, now, I believe... and my mother’s must be too.... Well, that’s all. Be careful, though. Will you come and see me in prison when I am there?”"
                },
                {
                    "line_number": 6253,
                    "text": "They sat side by side, both mournful and dejected, as though they had been cast up by the tempest alone on some deserted shore. He looked at Sonia and felt how great was her love for him, and strange to say he felt it suddenly burdensome and painful to be so loved. Yes, it was a strange and awful sensation! On his way to see Sonia he had felt that all his hopes rested on her; he expected to be rid of at least part of his suffering, and now, when all her heart turned towards him, he suddenly felt that he was immeasurably unhappier than before."
                },
                {
                    "line_number": 6255,
                    "text": "“Sonia,” he said, “you’d better not come and see me when I am in prison.”"
                },
                {
                    "line_number": 6257,
                    "text": "Sonia did not answer, she was crying. Several minutes passed."
                },
                {
                    "line_number": 6269,
                    "text": "“Not now, Sonia. Better later,” he added to comfort her."
                },
                {
                    "line_number": 6277,
                    "text": "Sonia rushed to the door in a fright. The flaxen head of Mr. Lebeziatnikov appeared at the door."
                },
                {
                    "line_number": 6282,
                    "text": "“I’ve come to you, Sofya Semyonovna,” he began. “Excuse me... I thought I should find you,” he said, addressing Raskolnikov suddenly, “that is, I didn’t mean anything... of that sort... But I just thought... Katerina Ivanovna has gone out of her mind,” he blurted out suddenly, turning from Raskolnikov to Sonia."
                },
                {
                    "line_number": 6284,
                    "text": "Sonia screamed."
                },
                {
                    "line_number": 6288,
                    "text": "Lebeziatnikov would have gone on, but Sonia, who had heard him almost breathless, snatched up her cloak and hat, and ran out of the room, putting on her things as she went. Raskolnikov followed her and Lebeziatnikov came after him."
                },
                {
                    "line_number": 6306,
                    "text": "Yes, he felt once more that he would perhaps come to hate Sonia, now that he had made her more miserable."
                },
                {
                    "line_number": 6316,
                    "text": "He could not have said how long he sat there with vague thoughts surging through his mind. All at once the door opened and Dounia came in. At first she stood still and looked at him from the doorway, just as he had done at Sonia; then she came in and sat down in the same place as yesterday, on the chair facing him. He looked silently and almost vacantly at her."
                },
                {
                    "line_number": 6348,
                    "text": "And he thought of Sonia."
                },
                {
                    "line_number": 6356,
                    "text": "“With this idiotic, purely physical weakness, depending on the sunset or something, one can’t help doing something stupid! You’ll go to Dounia, as well as to Sonia,” he muttered bitterly."
                },
                {
                    "line_number": 6362,
                    "text": "“And Sonia?” Raskolnikov asked anxiously, hurrying after Lebeziatnikov."
                },
                {
                    "line_number": 6366,
                    "text": "On the canal bank near the bridge and not two houses away from the one where Sonia lodged, there was a crowd of people, consisting principally of gutter children. The hoarse broken voice of Katerina Ivanovna could be heard from the bridge, and it certainly was a strange spectacle likely to attract a street crowd. Katerina Ivanovna in her old dress with the green shawl, wearing a torn straw hat, crushed in a hideous way on one side, was really frantic. She was exhausted and breathless. Her wasted consumptive face looked more suffering than ever, and indeed out of doors in the sunshine a consumptive always looks worse than at home. But her excitement did not flag, and every moment her irritation grew more intense. She rushed at the children, shouted at them, coaxed them, told them before the crowd how to dance and what to sing, began explaining to them why it was necessary, and driven to desperation by their not understanding, beat them.... Then she would make a rush at the crowd; if she noticed any decently dressed person stopping to look, she immediately appealed to him to see what these children “from a genteel, one may say aristocratic, house” had been brought to. If she heard laughter or jeering in the crowd, she would rush at once at the scoffers and begin squabbling with them. Some people laughed, others shook their heads, but everyone felt curious at the sight of the madwoman with the frightened children. The frying-pan of which Lebeziatnikov had spoken was not there, at least Raskolnikov did not see it. But instead of rapping on the pan, Katerina Ivanovna began clapping her wasted hands, when she made Lida and Kolya dance and Polenka sing. She too joined in the singing, but broke down at the second note with a fearful cough, which made her curse in despair and even shed tears. What made her most furious was the weeping and terror of Kolya and Lida. Some effort had been made to dress the children up as street singers are dressed. The boy had on a turban made of something red and white to look like a Turk. There had been no costume for Lida; she simply had a red knitted cap, or rather a night cap that had belonged to Marmeladov, decorated with a broken piece of white ostrich feather, which had been Katerina Ivanovna’s grandmother’s and had been preserved as a family possession. Polenka was in her everyday dress; she looked in timid perplexity at her mother, and kept at her side, hiding her tears. She dimly realised her mother’s condition, and looked uneasily about her. She was terribly frightened of the street and the crowd. Sonia followed Katerina Ivanovna, weeping and beseeching her to return home, but Katerina Ivanovna was not to be persuaded."
                },
                {
                    "line_number": 6368,
                    "text": "“Leave off, Sonia, leave off,” she shouted, speaking fast, panting and coughing. “You don’t know what you ask; you are like a child! I’ve told you before that I am not coming back to that drunken German. Let everyone, let all Petersburg see the children begging in the streets, though their father was an honourable man who served all his life in truth and fidelity, and one may say died in the service.” (Katerina Ivanovna had by now invented this fantastic story and thoroughly believed it.) “Let that wretch of a general see it! And you are silly, Sonia: what have we to eat? Tell me that. We have worried you enough, I won’t go on so! Ah, Rodion Romanovitch, is that you?” she cried, seeing Raskolnikov and rushing up to him. “Explain to this silly girl, please, that nothing better could be done! Even organ-grinders earn their living, and everyone will see at once that we are different, that we are an honourable and bereaved family reduced to beggary. And that general will lose his post, you’ll see! We shall perform under his windows every day, and if the Tsar drives by, I’ll fall on my knees, put the children before me, show them to him, and say ‘Defend us father.’ He is the father of the fatherless, he is merciful, he’ll protect us, you’ll see, and that wretch of a general.... Lida, tenez vous droite! Kolya, you’ll dance again. Why are you whimpering? Whimpering again! What are you afraid of, stupid? Goodness, what am I to do with them, Rodion Romanovitch? If you only knew how stupid they are! What’s one to do with such children?”"
                },
                {
                    "line_number": 6372,
                    "text": "“A boarding-school, ha-ha-ha! A castle in the air,” cried Katerina Ivanovna, her laugh ending in a cough. “No, Rodion Romanovitch, that dream is over! All have forsaken us!... And that general.... You know, Rodion Romanovitch, I threw an inkpot at him—it happened to be standing in the waiting-room by the paper where you sign your name. I wrote my name, threw it at him and ran away. Oh, the scoundrels, the scoundrels! But enough of them, now I’ll provide for the children myself, I won’t bow down to anybody! She has had to bear enough for us!” she pointed to Sonia. “Polenka, how much have you got? Show me! What, only two farthings! Oh, the mean wretches! They give us nothing, only run after us, putting their tongues out. There, what is that blockhead laughing at?” (She pointed to a man in the crowd.) “It’s all because Kolya here is so stupid; I have such a bother with him. What do you want, Polenka? Tell me in French, parlez-moi français. Why, I’ve taught you, you know some phrases. Else how are you to show that you are of good family, well brought-up children, and not at all like other organ-grinders? We aren’t going to have a Punch and Judy show in the street, but to sing a genteel song.... Ah, yes,... What are we to sing? You keep putting me out, but we... you see, we are standing here, Rodion Romanovitch, to find something to sing and get money, something Kolya can dance to.... For, as you can fancy, our performance is all impromptu.... We must talk it over and rehearse it all thoroughly, and then we shall go to Nevsky, where there are far more people of good society, and we shall be noticed at once. Lida knows ‘My Village’ only, nothing but ‘My Village,’ and everyone sings that. We must sing something far more genteel.... Well, have you thought of anything, Polenka? If only you’d help your mother! My memory’s quite gone, or I should have thought of something. We really can’t sing ‘An Hussar.’ Ah, let us sing in French, ‘Cinq sous,’ I have taught it you, I have taught it you. And as it is in French, people will see at once that you are children of good family, and that will be much more touching.... You might sing ‘Marlborough s’en va-t-en guerre,’ for that’s quite a child’s song and is sung as a lullaby in all the aristocratic houses."
                },
                {
                    "line_number": 6378,
                    "text": "(Cough-cough-cough!) “Set your dress straight, Polenka, it’s slipped down on your shoulders,” she observed, panting from coughing. “Now it’s particularly necessary to behave nicely and genteelly, that all may see that you are well-born children. I said at the time that the bodice should be cut longer, and made of two widths. It was your fault, Sonia, with your advice to make it shorter, and now you see the child is quite deformed by it.... Why, you’re all crying again! What’s the matter, stupids? Come, Kolya, begin. Make haste, make haste! Oh, what an unbearable child!"
                },
                {
                    "line_number": 6398,
                    "text": "“Honoured sir, honoured sir, you don’t know,” screamed Katerina Ivanovna. “We are going to the Nevsky.... Sonia, Sonia! Where is she? She is crying too! What’s the matter with you all? Kolya, Lida, where are you going?” she cried suddenly in alarm. “Oh, silly children! Kolya, Lida, where are they off to?...”"
                },
                {
                    "line_number": 6400,
                    "text": "Kolya and Lida, scared out of their wits by the crowd, and their mother’s mad pranks, suddenly seized each other by the hand, and ran off at the sight of the policeman who wanted to take them away somewhere. Weeping and wailing, poor Katerina Ivanovna ran after them. She was a piteous and unseemly spectacle, as she ran, weeping and panting for breath. Sonia and Polenka rushed after them."
                },
                {
                    "line_number": 6402,
                    "text": "“Bring them back, bring them back, Sonia! Oh stupid, ungrateful children!... Polenka! catch them.... It’s for your sakes I...”"
                },
                {
                    "line_number": 6406,
                    "text": "“She’s cut herself, she’s bleeding! Oh, dear!” cried Sonia, bending over her."
                },
                {
                    "line_number": 6418,
                    "text": "When they examined Katerina Ivanovna carefully, they saw that she had not cut herself against a stone, as Sonia thought, but that the blood that stained the pavement red was from her chest."
                },
                {
                    "line_number": 6422,
                    "text": "“This way, this way, to my room!” Sonia implored. “I live here!... See, that house, the second from here.... Come to me, make haste,” she turned from one to the other. “Send for the doctor! Oh, dear!”"
                },
                {
                    "line_number": 6424,
                    "text": "Thanks to the official’s efforts, this plan was adopted, the policeman even helping to carry Katerina Ivanovna. She was carried to Sonia’s room, almost unconscious, and laid on the bed. The blood was still flowing, but she seemed to be coming to herself. Raskolnikov, Lebeziatnikov, and the official accompanied Sonia into the room and were followed by the policeman, who first drove back the crowd which followed to the very door. Polenka came in holding Kolya and Lida, who were trembling and weeping. Several persons came in too from the Kapernaumovs’ room; the landlord, a lame one-eyed man of strange appearance with whiskers and hair that stood up like a brush, his wife, a woman with an everlastingly scared expression, and several open-mouthed children with wonder-struck faces. Among these, Svidrigaïlov suddenly made his appearance. Raskolnikov looked at him with surprise, not understanding where he had come from and not having noticed him in the crowd. A doctor and priest wore spoken of. The official whispered to Raskolnikov that he thought it was too late now for the doctor, but he ordered him to be sent for. Kapernaumov ran himself."
                },
                {
                    "line_number": 6426,
                    "text": "Meanwhile Katerina Ivanovna had regained her breath. The bleeding ceased for a time. She looked with sick but intent and penetrating eyes at Sonia, who stood pale and trembling, wiping the sweat from her brow with a handkerchief. At last she asked to be raised. They sat her up on the bed, supporting her on both sides."
                },
                {
                    "line_number": 6432,
                    "text": "“So that’s how you live, Sonia! Never once have I been in your room.”"
                },
                {
                    "line_number": 6436,
                    "text": "“We have been your ruin, Sonia. Polenka, Lida, Kolya, come here! Well, here they are, Sonia, take them all! I hand them over to you, I’ve had enough! The ball is over.” (Cough!) “Lay me down, let me die in peace.”"
                },
                {
                    "line_number": 6462,
                    "text": "“Your excellency!” she wailed suddenly with a heart-rending scream and a flood of tears, “protect the orphans! You have been their father’s guest... one may say aristocratic....” She started, regaining consciousness, and gazed at all with a sort of terror, but at once recognised Sonia."
                },
                {
                    "line_number": 6464,
                    "text": "“Sonia, Sonia!” she articulated softly and caressingly, as though surprised to find her there. “Sonia darling, are you here, too?”"
                },
                {
                    "line_number": 6472,
                    "text": "Sonia fell upon her, flung her arms about her, and remained motionless with her head pressed to the dead woman’s wasted bosom. Polenka threw herself at her mother’s feet, kissing them and weeping violently. Though Kolya and Lida did not understand what had happened, they had a feeling that it was something terrible; they put their hands on each other’s little shoulders, stared straight at one another and both at once opened their mouths and began screaming. They were both still in their fancy dress; one in a turban, the other in the cap with the ostrich feather."
                },
                {
                    "line_number": 6490,
                    "text": "He said this with an air of a sort of gay winking slyness, keeping his eyes fixed on Raskolnikov, who turned white and cold, hearing his own phrases, spoken to Sonia. He quickly stepped back and looked wildly at Svidrigaïlov."
                },
                {
                    "line_number": 6504,
                    "text": "He was particularly worried about Svidrigaïlov, he might be said to be permanently thinking of Svidrigaïlov. From the time of Svidrigaïlov’s too menacing and unmistakable words in Sonia’s room at the moment of Katerina Ivanovna’s death, the normal working of his mind seemed to break down. But although this new fact caused him extreme uneasiness, Raskolnikov was in no hurry for an explanation of it. At times, finding himself in a solitary and remote part of the town, in some wretched eating-house, sitting alone lost in thought, hardly knowing how he had come there, he suddenly thought of Svidrigaïlov. He recognised suddenly, clearly, and with dismay that he ought at once to come to an understanding with that man and to make what terms he could. Walking outside the city gates one day, he positively fancied that they had fixed a meeting there, that he was waiting for Svidrigaïlov. Another time he woke up before daybreak lying on the ground under some bushes and could not at first understand how he had come there."
                },
                {
                    "line_number": 6506,
                    "text": "But during the two or three days after Katerina Ivanovna’s death, he had two or three times met Svidrigaïlov at Sonia’s lodging, where he had gone aimlessly for a moment. They exchanged a few words and made no reference to the vital subject, as though they were tacitly agreed not to speak of it for a time."
                },
                {
                    "line_number": 6508,
                    "text": "Katerina Ivanovna’s body was still lying in the coffin, Svidrigaïlov was busy making arrangements for the funeral. Sonia too was very busy. At their last meeting Svidrigaïlov informed Raskolnikov that he had made an arrangement, and a very satisfactory one, for Katerina Ivanovna’s children; that he had, through certain connections, succeeded in getting hold of certain personages by whose help the three orphans could be at once placed in very suitable institutions; that the money he had settled on them had been of great assistance, as it is much easier to place orphans with some property than destitute ones. He said something too about Sonia and promised to come himself in a day or two to see Raskolnikov, mentioning that “he would like to consult with him, that there were things they must talk over....”"
                },
                {
                    "line_number": 6512,
                    "text": "He moved to one side to make way for the priest and server, who were coming up the stairs. They had come for the requiem service. By Svidrigaïlov’s orders it was sung twice a day punctually. Svidrigaïlov went his way. Raskolnikov stood still a moment, thought, and followed the priest into Sonia’s room. He stood at the door. They began quietly, slowly and mournfully singing the service. From his childhood the thought of death and the presence of death had something oppressive and mysteriously awful; and it was long since he had heard the requiem service. And there was something else here as well, too awful and disturbing. He looked at the children: they were all kneeling by the coffin; Polenka was weeping. Behind them Sonia prayed, softly and, as it were, timidly weeping."
                },
                {
                    "line_number": 6514,
                    "text": "“These last two days she hasn’t said a word to me, she hasn’t glanced at me,” Raskolnikov thought suddenly. The sunlight was bright in the room; the incense rose in clouds; the priest read, “Give rest, oh Lord....” Raskolnikov stayed all through the service. As he blessed them and took his leave, the priest looked round strangely. After the service, Raskolnikov went up to Sonia. She took both his hands and let her head sink on his shoulder. This slight friendly gesture bewildered Raskolnikov. It seemed strange to him that there was no trace of repugnance, no trace of disgust, no tremor in her hand. It was the furthest limit of self-abnegation, at least so he interpreted it."
                },
                {
                    "line_number": 6516,
                    "text": "Sonia said nothing. Raskolnikov pressed her hand and went out. He felt very miserable. If it had been possible to escape to some solitude, he would have thought himself lucky, even if he had to spend his whole life there. But although he had almost always been by himself of late, he had never been able to feel alone. Sometimes he walked out of the town on to the high road, once he had even reached a little wood, but the lonelier the place was, the more he seemed to be aware of an uneasy presence near him. It did not frighten him, but greatly annoyed him, so that he made haste to return to the town, to mingle with the crowd, to enter restaurants and taverns, to walk in busy thoroughfares. There he felt easier and even more solitary. One day at dusk he sat for an hour listening to songs in a tavern and he remembered that he positively enjoyed it. But at last he had suddenly felt the same uneasiness again, as though his conscience smote him. “Here I sit listening to singing, is that what I ought to be doing?” he thought. Yet he felt at once that that was not the only cause of his uneasiness; there was something requiring immediate decision, but it was something he could not clearly understand or put into words. It was a hopeless tangle. “No, better the struggle again! Better Porfiry again... or Svidrigaïlov.... Better some challenge again... some attack. Yes, yes!” he thought. He went out of the tavern and rushed away almost at a run. The thought of Dounia and his mother suddenly reduced him almost to a panic. That night he woke up before morning among some bushes in Krestovsky Island, trembling all over with fever; he walked home, and it was early morning when he arrived. After some hours’ sleep the fever left him, but he woke up late, two o’clock in the afternoon."
                },
                {
                    "line_number": 6618,
                    "text": "“Yes, a means of escape had come! It had been too stifling, too cramping, the burden had been too agonising. A lethargy had come upon him at times. From the moment of the scene with Nikolay at Porfiry’s he had been suffocating, penned in without hope of escape. After Nikolay’s confession, on that very day had come the scene with Sonia; his behaviour and his last words had been utterly unlike anything he could have imagined beforehand; he had grown feebler, instantly and fundamentally! And he had agreed at the time with Sonia, he had agreed in his heart he could not go on living alone with such a thing on his mind!"
                },
                {
                    "line_number": 6806,
                    "text": "And yet he was hastening to Svidrigaïlov; could he be expecting something new from him, information, or means of escape? Men will catch at straws! Was it destiny or some instinct bringing them together? Perhaps it was only fatigue, despair; perhaps it was not Svidrigaïlov but some other whom he needed, and Svidrigaïlov had simply presented himself by chance. Sonia? But what should he go to Sonia for now? To beg her tears again? He was afraid of Sonia, too. Sonia stood before him as an irrevocable sentence. He must go his own way or hers. At that moment especially he did not feel equal to seeing her. No, would it not be better to try Svidrigaïlov? And he could not help inwardly owning that he had long felt that he must see him for some reason."
                },
                {
                    "line_number": 7114,
                    "text": "Svidrigaïlov stopped at Sonia’s room."
                },
                {
                    "line_number": 7303,
                    "text": "Drenched to the skin, he went home, locked himself in, opened the bureau, took out all his money and tore up two or three papers. Then, putting the money in his pocket, he was about to change his clothes, but, looking out of the window and listening to the thunder and the rain, he gave up the idea, took up his hat and went out of the room without locking the door. He went straight to Sonia. She was at home."
                },
                {
                    "line_number": 7307,
                    "text": "Svidrigaïlov sat down at the table and asked Sonia to sit beside him. She timidly prepared to listen."
                },
                {
                    "line_number": 7309,
                    "text": "“I may be going to America, Sofya Semyonovna,” said Svidrigaïlov, “and as I am probably seeing you for the last time, I have come to make some arrangements. Well, did you see the lady to-day? I know what she said to you, you need not tell me.” (Sonia made a movement and blushed.) “Those people have their own way of doing things. As to your sisters and your brother, they are really provided for and the money assigned to them I’ve put into safe keeping and have received acknowledgments. You had better take charge of the receipts, in case anything happens. Here, take them! Well now, that’s settled. Here are three 5-per-cent bonds to the value of three thousand roubles. Take those for yourself, entirely for yourself, and let that be strictly between ourselves, so that no one knows of it, whatever you hear. You will need the money, for to go on living in the old way, Sofya Semyonovna, is bad, and besides there is no need for it now.”"
                },
                {
                    "line_number": 7311,
                    "text": "“I am so much indebted to you, and so are the children and my stepmother,” said Sonia hurriedly, “and if I’ve said so little... please don’t consider...”"
                },
                {
                    "line_number": 7317,
                    "text": "“It’s for you, for you, Sofya Semyonovna, and please don’t waste words over it. I haven’t time for it. You will want it. Rodion Romanovitch has two alternatives: a bullet in the brain or Siberia.” (Sonia looked wildly at him, and started.) “Don’t be uneasy, I know all about it from himself and I am not a gossip; I won’t tell anyone. It was good advice when you told him to give himself up and confess. It would be much better for him. Well, if it turns out to be Siberia, he will go and you will follow him. That’s so, isn’t it? And if so, you’ll need money. You’ll need it for him, do you understand? Giving it to you is the same as my giving it to him. Besides, you promised Amalia Ivanovna to pay what’s owing. I heard you. How can you undertake such obligations so heedlessly, Sofya Semyonovna? It was Katerina Ivanovna’s debt and not yours, so you ought not to have taken any notice of the German woman. You can’t get through the world like that. If you are ever questioned about me—to-morrow or the day after you will be asked—don’t say anything about my coming to see you now and don’t show the money to anyone or say a word about it. Well, now good-bye.” (He got up.) “My greetings to Rodion Romanovitch. By the way, you’d better put the money for the present in Mr. Razumihin’s keeping. You know Mr. Razumihin? Of course you do. He’s not a bad fellow. Take it to him to-morrow or... when the time comes. And till then, hide it carefully.”"
                },
                {
                    "line_number": 7319,
                    "text": "Sonia too jumped up from her chair and looked in dismay at Svidrigaïlov. She longed to speak, to ask a question, but for the first moments she did not dare and did not know how to begin."
                },
                {
                    "line_number": 7325,
                    "text": "He went out, leaving Sonia in a state of wondering anxiety and vague apprehension."
                },
                {
                    "line_number": 7579,
                    "text": "When he went into Sonia’s room, it was already getting dark. All day Sonia had been waiting for him in terrible anxiety. Dounia had been waiting with her. She had come to her that morning, remembering Svidrigaïlov’s words that Sonia knew. We will not describe the conversation and tears of the two girls, and how friendly they became. Dounia gained one comfort at least from that interview, that her brother would not be alone. He had gone to her, Sonia, first with his confession; he had gone to her for human fellowship when he needed it; she would go with him wherever fate might send him. Dounia did not ask, but she knew it was so. She looked at Sonia almost with reverence and at first almost embarrassed her by it. Sonia was almost on the point of tears. She felt herself, on the contrary, hardly worthy to look at Dounia. Dounia’s gracious image when she had bowed to her so attentively and respectfully at their first meeting in Raskolnikov’s room had remained in her mind as one of the fairest visions of her life."
                },
                {
                    "line_number": 7581,
                    "text": "Dounia at last became impatient and, leaving Sonia, went to her brother’s room to await him there; she kept thinking that he would come there first. When she had gone, Sonia began to be tortured by the dread of his committing suicide, and Dounia too feared it. But they had spent the day trying to persuade each other that that could not be, and both were less anxious while they were together. As soon as they parted, each thought of nothing else. Sonia remembered how Svidrigaïlov had said to her the day before that Raskolnikov had two alternatives—Siberia or... Besides she knew his vanity, his pride and his lack of faith."
                },
                {
                    "line_number": 7585,
                    "text": "Meanwhile the sun was setting. Sonia was standing in dejection, looking intently out of the window, but from it she could see nothing but the unwhitewashed blank wall of the next house. At last when she began to feel sure of his death—he walked into the room."
                },
                {
                    "line_number": 7589,
                    "text": "“Yes,” said Raskolnikov, smiling. “I have come for your cross, Sonia. It was you told me to go to the cross-roads; why is it you are frightened now it’s come to that?”"
                },
                {
                    "line_number": 7591,
                    "text": "Sonia gazed at him astonished. His tone seemed strange to her; a cold shiver ran over her, but in a moment she guessed that the tone and the words were a mask. He spoke to her looking away, as though to avoid meeting her eyes."
                },
                {
                    "line_number": 7593,
                    "text": "“You see, Sonia, I’ve decided that it will be better so. There is one fact.... But it’s a long story and there’s no need to discuss it. But do you know what angers me? It annoys me that all those stupid brutish faces will be gaping at me directly, pestering me with their stupid questions, which I shall have to answer—they’ll point their fingers at me.... Tfoo! You know I am not going to Porfiry, I am sick of him. I’d rather go to my friend, the Explosive Lieutenant; how I shall surprise him, what a sensation I shall make! But I must be cooler; I’ve become too irritable of late. You know I was nearly shaking my fist at my sister just now, because she turned to take a last look at me. It’s a brutal state to be in! Ah! what am I coming to! Well, where are the crosses?”"
                },
                {
                    "line_number": 7597,
                    "text": "Without a word Sonia took out of the drawer two crosses, one of cypress wood and one of copper. She made the sign of the cross over herself and over him, and put the wooden cross on his neck."
                },
                {
                    "line_number": 7599,
                    "text": "“It’s the symbol of my taking up the cross,” he laughed. “As though I had not suffered much till now! The wooden cross, that is the peasant one; the copper one, that is Lizaveta’s—you will wear yourself, show me! So she had it on... at that moment? I remember two things like these too, a silver one and a little ikon. I threw them back on the old woman’s neck. Those would be appropriate now, really, those are what I ought to put on now.... But I am talking nonsense and forgetting what matters; I’m somehow forgetful.... You see I have come to warn you, Sonia, so that you might know... that’s all—that’s all I came for. But I thought I had more to say. You wanted me to go yourself. Well, now I am going to prison and you’ll have your wish. Well, what are you crying for? You too? Don’t. Leave off! Oh, how I hate it all!”"
                },
                {
                    "line_number": 7603,
                    "text": "“Cross yourself, say at least one prayer,” Sonia begged in a timid broken voice."
                },
                {
                    "line_number": 7605,
                    "text": "“Oh certainly, as much as you like! And sincerely, Sonia, sincerely....”"
                },
                {
                    "line_number": 7609,
                    "text": "He crossed himself several times. Sonia took up her shawl and put it over her head. It was the green drap de dames shawl of which Marmeladov had spoken, “the family shawl.” Raskolnikov thought of that looking at it, but he did not ask. He began to feel himself that he was certainly forgetting things and was disgustingly agitated. He was frightened at this. He was suddenly struck too by the thought that Sonia meant to go with him."
                },
                {
                    "line_number": 7613,
                    "text": "Sonia remained standing in the middle of the room. He had not even said good-bye to her; he had forgotten her. A poignant and rebellious doubt surged in his heart."
                },
                {
                    "line_number": 7617,
                    "text": "But still he went. He felt suddenly once for all that he mustn’t ask himself questions. As he turned into the street he remembered that he had not said good-bye to Sonia, that he had left her in the middle of the room in her green shawl, not daring to stir after he had shouted at her, and he stopped short for a moment. At the same instant, another thought dawned upon him, as though it had been lying in wait to strike him then."
                },
                {
                    "line_number": 7629,
                    "text": "He suddenly recalled Sonia’s words, “Go to the cross-roads, bow down to the people, kiss the earth, for you have sinned against it too, and say aloud to the whole world, ‘I am a murderer.’” He trembled, remembering that. And the hopeless misery and anxiety of all that time, especially of the last hours, had weighed so heavily upon him that he positively clutched at the chance of this new unmixed, complete sensation. It came over him like a fit; it was like a single spark kindled in his soul and spreading fire through him. Everything in him softened at once and the tears started into his eyes. He fell to the earth on the spot...."
                },
                {
                    "line_number": 7645,
                    "text": "These exclamations and remarks checked Raskolnikov, and the words, “I am a murderer,” which were perhaps on the point of dropping from his lips, died away. He bore these remarks quietly, however, and, without looking round, he turned down a street leading to the police office. He had a glimpse of something on the way which did not surprise him; he had felt that it must be so. The second time he bowed down in the Hay Market he saw, standing fifty paces from him on the left, Sonia. She was hiding from him behind one of the wooden shanties in the market-place. She had followed him then on his painful way! Raskolnikov at that moment felt and knew once for all that Sonia was with him for ever and would follow him to the ends of the earth, wherever fate might take him. It wrung his heart... but he was just reaching the fatal place."
                },
                {
                    "line_number": 7727,
                    "text": "He went out; he reeled, he was overtaken with giddiness and did not know what he was doing. He began going down the stairs, supporting himself with his right hand against the wall. He fancied that a porter pushed past him on his way upstairs to the police office, that a dog in the lower storey kept up a shrill barking and that a woman flung a rolling-pin at it and shouted. He went down and out into the yard. There, not far from the entrance, stood Sonia, pale and horror-stricken. She looked wildly at him. He stood still before her. There was a look of poignant agony, of despair, in her face. She clasped her hands. His lips worked in an ugly, meaningless smile. He stood still a minute, grinned and went back to the police office."
                },
                {
                    "line_number": 7773,
                    "text": "Five months after Raskolnikov’s confession, he was sentenced. Razumihin and Sonia saw him in prison as often as it was possible. At last the moment of separation came. Dounia swore to her brother that the separation should not be for ever, Razumihin did the same. Razumihin, in his youthful ardour, had firmly resolved to lay the foundations at least of a secure livelihood during the next three or four years, and saving up a certain sum, to emigrate to Siberia, a country rich in every natural resource and in need of workers, active men and capital. There they would settle in the town where Rodya was and all together would begin a new life. They all wept at parting."
                },
                {
                    "line_number": 7775,
                    "text": "Raskolnikov had been very dreamy for a few days before. He asked a great deal about his mother and was constantly anxious about her. He worried so much about her that it alarmed Dounia. When he heard about his mother’s illness he became very gloomy. With Sonia he was particularly reserved all the time. With the help of the money left to her by Svidrigaïlov, Sonia had long ago made her preparations to follow the party of convicts in which he was despatched to Siberia. Not a word passed between Raskolnikov and her on the subject, but both knew it would be so. At the final leave-taking he smiled strangely at his sister’s and Razumihin’s fervent anticipations of their happy future together when he should come out of prison. He predicted that their mother’s illness would soon have a fatal ending. Sonia and he at last set off."
                },
                {
                    "line_number": 7777,
                    "text": "Two months later Dounia was married to Razumihin. It was a quiet and sorrowful wedding; Porfiry Petrovitch and Zossimov were invited however. During all this period Razumihin wore an air of resolute determination. Dounia put implicit faith in his carrying out his plans and indeed she could not but believe in him. He displayed a rare strength of will. Among other things he began attending university lectures again in order to take his degree. They were continually making plans for the future; both counted on settling in Siberia within five years at least. Till then they rested their hopes on Sonia."
                },
                {
                    "line_number": 7783,
                    "text": "For a long time Raskolnikov did not know of his mother’s death, though a regular correspondence had been maintained from the time he reached Siberia. It was carried on by means of Sonia, who wrote every month to the Razumihins and received an answer with unfailing regularity. At first they found Sonia’s letters dry and unsatisfactory, but later on they came to the conclusion that the letters could not be better, for from these letters they received a complete picture of their unfortunate brother’s life. Sonia’s letters were full of the most matter-of-fact detail, the simplest and clearest description of all Raskolnikov’s surroundings as a convict. There was no word of her own hopes, no conjecture as to the future, no description of her feelings. Instead of any attempt to interpret his state of mind and inner life, she gave the simple facts—that is, his own words, an exact account of his health, what he asked for at their interviews, what commission he gave her and so on. All these facts she gave with extraordinary minuteness. The picture of their unhappy brother stood out at last with great clearness and precision. There could be no mistake, because nothing was given but facts."
                },
                {
                    "line_number": 7785,
                    "text": "But Dounia and her husband could get little comfort out of the news, especially at first. Sonia wrote that he was constantly sullen and not ready to talk, that he scarcely seemed interested in the news she gave him from their letters, that he sometimes asked after his mother and that when, seeing that he had guessed the truth, she told him at last of her death, she was surprised to find that he did not seem greatly affected by it, not externally at any rate. She told them that, although he seemed so wrapped up in himself and, as it were, shut himself off from everyone—he took a very direct and simple view of his new life; that he understood his position, expected nothing better for the time, had no ill-founded hopes (as is so common in his position) and scarcely seemed surprised at anything in his surroundings, so unlike anything he had known before. She wrote that his health was satisfactory; he did his work without shirking or seeking to do more; he was almost indifferent about food, but except on Sundays and holidays the food was so bad that at last he had been glad to accept some money from her, Sonia, to have his own tea every day. He begged her not to trouble about anything else, declaring that all this fuss about him only annoyed him. Sonia wrote further that in prison he shared the same room with the rest, that she had not seen the inside of their barracks, but concluded that they were crowded, miserable and unhealthy; that he slept on a plank bed with a rug under him and was unwilling to make any other arrangement. But that he lived so poorly and roughly, not from any plan or design, but simply from inattention and indifference."
                },
                {
                    "line_number": 7787,
                    "text": "Sonia wrote simply that he had at first shown no interest in her visits, had almost been vexed with her indeed for coming, unwilling to talk and rude to her. But that in the end these visits had become a habit and almost a necessity for him, so that he was positively distressed when she was ill for some days and could not visit him. She used to see him on holidays at the prison gates or in the guard-room, to which he was brought for a few minutes to see her. On working days she would go to see him at work either at the workshops or at the brick kilns, or at the sheds on the banks of the Irtish."
                },
                {
                    "line_number": 7789,
                    "text": "About herself, Sonia wrote that she had succeeded in making some acquaintances in the town, that she did sewing, and, as there was scarcely a dressmaker in the town, she was looked upon as an indispensable person in many houses. But she did not mention that the authorities were, through her, interested in Raskolnikov; that his task was lightened and so on."
                },
                {
                    "line_number": 7791,
                    "text": "At last the news came (Dounia had indeed noticed signs of alarm and uneasiness in the preceding letters) that he held aloof from everyone, that his fellow prisoners did not like him, that he kept silent for days at a time and was becoming very pale. In the last letter Sonia wrote that he had been taken very seriously ill and was in the convict ward of the hospital."
                },
                {
                    "line_number": 7794,
                    "text": "He was ill a long time. But it was not the horrors of prison life, not the hard labour, the bad food, the shaven head, or the patched clothes that crushed him. What did he care for all those trials and hardships! he was even glad of the hard work. Physically exhausted, he could at least reckon on a few hours of quiet sleep. And what was the food to him—the thin cabbage soup with beetles floating in it? In the past as a student he had often not had even that. His clothes were warm and suited to his manner of life. He did not even feel the fetters. Was he ashamed of his shaven head and parti-coloured coat? Before whom? Before Sonia? Sonia was afraid of him, how could he be ashamed before her? And yet he was ashamed even before Sonia, whom he tortured because of it with his contemptuous rough manner. But it was not his shaven head and his fetters he was ashamed of: his pride had been stung to the quick. It was wounded pride that made him ill. Oh, how happy he would have been if he could have blamed himself! He could have borne anything then, even shame and disgrace. But he judged himself severely, and his exasperated conscience found no particularly terrible fault in his past, except a simple blunder which might happen to anyone. He was ashamed just because he, Raskolnikov, had so hopelessly, stupidly come to grief through some decree of blind fate, and must humble himself and submit to “the idiocy” of a sentence, if he were anyhow to be at peace."
                },
                {
                    "line_number": 7824,
                    "text": "There was another question he could not decide: why were they all so fond of Sonia? She did not try to win their favour; she rarely met them, sometimes only she came to see him at work for a moment. And yet everybody knew her, they knew that she had come out to follow him, knew how and where she lived. She never gave them money, did them no particular services. Only once at Christmas she sent them all presents of pies and rolls. But by degrees closer relations sprang up between them and Sonia. She would write and post letters for them to their relations. Relations of the prisoners who visited the town, at their instructions, left with Sonia presents and money for them. Their wives and sweethearts knew her and used to visit her. And when she visited Raskolnikov at work, or met a party of the prisoners on the road, they all took off their hats to her. “Little mother Sofya Semyonovna, you are our dear, good little mother,” coarse branded criminals said to that frail little creature. She would smile and bow to them and everyone was delighted when she smiled. They even admired her gait and turned round to watch her walking; they admired her too for being so little, and, in fact, did not know what to admire her most for. They even came to her for help in their illnesses."
                },
                {
                    "line_number": 7828,
                    "text": "Raskolnikov was worried that this senseless dream haunted his memory so miserably, the impression of this feverish delirium persisted so long. The second week after Easter had come. There were warm bright spring days; in the prison ward the grating windows under which the sentinel paced were opened. Sonia had only been able to visit him twice during his illness; each time she had to obtain permission, and it was difficult. But she often used to come to the hospital yard, especially in the evening, sometimes only to stand a minute and look up at the windows of the ward."
                },
                {
                    "line_number": 7830,
                    "text": "One evening, when he was almost well again, Raskolnikov fell asleep. On waking up he chanced to go to the window, and at once saw Sonia in the distance at the hospital gate. She seemed to be waiting for someone. Something stabbed him to the heart at that minute. He shuddered and moved away from the window. Next day Sonia did not come, nor the day after; he noticed that he was expecting her uneasily. At last he was discharged. On reaching the prison he learnt from the convicts that Sofya Semyonovna was lying ill at home and was unable to go out."
                },
                {
                    "line_number": 7832,
                    "text": "He was very uneasy and sent to inquire after her; he soon learnt that her illness was not dangerous. Hearing that he was anxious about her, Sonia sent him a pencilled note, telling him that she was much better, that she had a slight cold and that she would soon, very soon come and see him at his work. His heart throbbed painfully as he read it."
                },
                {
                    "line_number": 7834,
                    "text": "Again it was a warm bright day. Early in the morning, at six o’clock, he went off to work on the river bank, where they used to pound alabaster and where there was a kiln for baking it in a shed. There were only three of them sent. One of the convicts went with the guard to the fortress to fetch a tool; the other began getting the wood ready and laying it in the kiln. Raskolnikov came out of the shed on to the river bank, sat down on a heap of logs by the shed and began gazing at the wide deserted river. From the high bank a broad landscape opened before him, the sound of singing floated faintly audible from the other bank. In the vast steppe, bathed in sunshine, he could just see, like black specks, the nomads’ tents. There there was freedom, there other men were living, utterly unlike those here; there time itself seemed to stand still, as though the age of Abraham and his flocks had not passed. Raskolnikov sat gazing, his thoughts passed into day-dreams, into contemplation; he thought of nothing, but a vague restlessness excited and troubled him. Suddenly he found Sonia beside him; she had come up noiselessly and sat down at his side. It was still quite early; the morning chill was still keen. She wore her poor old burnous and the green shawl; her face still showed signs of illness, it was thinner and paler. She gave him a joyful smile of welcome, but held out her hand with her usual timidity. She was always timid of holding out her hand to him and sometimes did not offer it at all, as though afraid he would repel it. He always took her hand as though with repugnance, always seemed vexed to meet her and was sometimes obstinately silent throughout her visit. Sometimes she trembled before him and went away deeply grieved. But now their hands did not part. He stole a rapid glance at her and dropped his eyes on the ground without speaking. They were alone, no one had seen them. The guard had turned away for the time."
                },
                {
                    "line_number": 7846,
                    "text": "Under his pillow lay the New Testament. He took it up mechanically. The book belonged to Sonia; it was the one from which she had read the raising of Lazarus to him. At first he was afraid that she would worry him about religion, would talk about the gospel and pester him with books. But to his great surprise she had not once approached the subject and had not even offered him the Testament. He had asked her for it himself not long before his illness and she brought him the book without a word. Till now he had not opened it."
                }
            ]
        }
    ]
}
